[
    {
        "id":"go-19iUS6U1UqYqiuv3AAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.bebee.com\/job\/baa1f0a805d1ec9de432b5ab102a2716?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"AI Conversational Systems Developer",
        "company":"PwC",
        "location":"Bengaluru, Karnataka",
        "date_posted":1740528000000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"About PwC Acceleration Center:\nThe PwC Advisory Acceleration Center in Bangalore is part of our Advisory business in the US. The team focuses on developing a broader portfolio with solutions for Risk Consulting, Management Consulting, Technology Consulting, Strategy Consulting, Forensics, and vertical-specific solutions. We are looking for an experienced Senior Associate with a strong analytical and Conversational AI background to work in our Digital Contact Solutions team within the Analytics Consulting practice.\n\nKey Responsibilities:\n• Collaborate with cross-functional teams to achieve goals\n• Lead teams for high-end analytics consulting engagements\n• Provide business recommendations to project teams\n• Develop and execute project analysis plans under the guidance of project manager",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-XBDWDZDGEEhlEtllAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.expertini.com\/jobs\/job\/chatbot-developers-conversational-ai--bengaluru-overture-rede-cbe8016c29\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Chatbot Developers (Conversational AI)",
        "company":"Overture Rede",
        "location":"Bengaluru, Karnataka",
        "date_posted":1739836800000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Position: Python Developer (SSE & TL)\n\nLocation: Bangalore (Client Office)\n\nDuration: Full-Time\n\nCompensation: Competitive (Exp * 3.5)\n\nNotice Period: 30 Days Only\n\nRole Overview: Looking for experienced Python Developers to work on big data solutions using PySpark and Hadoop in a client-facing environment.\n\nKey Responsibilities:\n• Develop and optimize data processing pipelines using Python and PySpark.\n• Work with Hadoop ecosystems for large-scale data processing.\n• Collaborate with cross-functional teams to implement scalable solutions.\n• Ensure performance tuning and best coding practices.\n\nRequired Skills:\n• 5–7 years (SSE) \/ 7–9 years (TL) of experience in Python development.\n• Strong expertise in PySpark and Hadoop.\n• Hands-on experience in big data processing and analytics.\n• Ability to work on-site in Bangalore.\n• Must be available to join within 30 days.\n\n4o",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-yW8PyOKRrOEbVNPAAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/careers.lilly.com\/fr\/fr\/job\/R-79496\/AI-ChatBot-Developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"AI ChatBot Developer",
        "company":"Lilly",
        "location":"Bengaluru, Karnataka",
        "date_posted":1739577600000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.\n\nDetailed Description:\n\nAt Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the globe.As a AI ChatBot Developer you should be able to design, develop and deploy conversational agents that can interact with humans in natural language.\n• Competency :\n\nLead AI ChatBot Developer\n• This position is for an expert in NLP and Text Processing to help us develop applications that automate communication and customer services.You will use Artificial Intelligence, NLP technologies, and cognitive machine learning to develop chatbot applications and also integrate solution with multiple platforms.You will also manage the data coming from chatbot conversations and analyse them. You will identify, analyze, and interpret the pattern, trends, and conversational flow in complex data sets. You should demonstrate an increased focus on customer engagement and should possess working knowledge of Frontend Technologies-– HTML, CSS, JavaScript, JSON, and REST APIs.\n\nKey Skills Required:\n• 5+ years hands on experience with chatbot development platforms and services (e.g., Kore.ai, Yellow.ai, Dialogflow, Microsoft Bot Framework, IBM Watson).\n• Strong programming skills in languages such as JSON, Microsoft Azure, Python, Java, JavaScript, etc.\n• Prior experience on hosting chatbots on multiple channels( teams, slack, sharepoint,web portal)\n• 5+ years of experience in developing and deploying using either Azure or AWS services\n• Familiarity with Generative AI services and RAG and Agentic applications .\n• Excellent problem-solving skills and attention to detail.\n• Ability to work collaboratively in a global team environment.\n• Strong communication skills to convey technical concepts effectively to non-technical people.\n• Experience with version control systems (e.g., Git) and CI\/CD practices.\n• Experience with testing and quality control.\n\nBachelor's or Master’s degree in Computer Science, Artificial Intelligence, or a related field\n\nKey responsibilities include:\n• Develop robust and scalable conversational AI chatbots utilising Kore.ai or equivalent platforms tailored to specific Lilly Service Desks requirements.\n• Collaborate with cross-functional teams to gather requirements, design conversational flows, and implement natural language processing (NLP) algorithms.\n• Design and integrate chatbots with various platforms and applications, ensuring seamless user experiences.\n• Conduct rigorous testing and debugging of chatbot functionalities to ensure high performance and accuracy.\n• Optimize chatbot responses based on user interactions, feedback, and data analysis.\n• Work closely with conversational UI designers to create visually appealing and user-friendly chatbot interfaces.\n• Provide technical guidance and support to internal teams regarding chatbot integration and customization.\n• Document chatbot development processes, algorithms, and code for future reference and collaboration.\n• Collaborate with stakeholders to understand business requirements, prioritise scope and translate requirements into technical specifications for chatbot development.\n\nBasic Qualifications:\n• Master's in computer science, Statistics, Computer Engineering, Electrical Engineering, Information Science, Information Engineering or related field\n• 5+ years of experience in NLP and chatbot development\n• Deep understanding of NLP techniques and systems\n\nAdditional Information:\n• Make the impossible possible in your quest to make life better.\n• Bring Analytics to life by giving it zeal and making it applicable to our business.\n• Know, learn, and keep up to date on the analytical, computational and scientific advances to maximize your impact.\n• Bring an insatiable desire to learn, to innovate, and to challenge yourself for the benefit of patients.\n• Thoroughly know conversational AI and machine learning concepts to build advanced bots.\n\nDesirable Skills:\n• In-depth knowledge of natural language processing (NLP) algorithm and frameworks (e.g., NLTK, spaCy, TensorFlow).\n• Highly motivated\/self-starter with a sense of ownership, willingness to learn, and desire to succeed\n• Strong teamwork, problem-solving, and analytical skills\n• Deep knowledge of math, probability, statistics and algorithms\n• Strong understanding of Pharma Quality Standards and Practices\n• Excellent leadership and interpersonal skills (both verbal and written)\n\nLilly is dedicated to helping individuals with disabilities to actively engage in the workforce, ensuring equal opportunities when vying for positions. If you require accommodation to submit a resume for a position at Lilly, please complete the accommodation request form (https:\/\/careers.lilly.com\/us\/en\/workplace-accommodation) for further assistance. Please note this is for individuals to request an accommodation as part of the application process and any other correspondence will not receive a response.\n\nLilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n\n#WeAreLilly",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-rtjKMJePAbst7jbDAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/www.glassdoor.co.in\/job-listing\/conversational-ai-developer-qualcomm-JV_IC2865319_KO0,27_KE28,36.htm?jl=1009526076552&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Conversational AI Developer",
        "company":"Qualcomm",
        "location":"Hyderabad, Telangana",
        "date_posted":1739404800000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":"disability-accomodations@qualcomm.com",
        "description":"Company:\n\nQualcomm India Private Limited\n\nJob Area:\n\nInformation Technology Group, Information Technology Group > IT Programmer Analyst\n\nGeneral Summary:\n\nQualcomm IT is seeking a Developer for Intelligent Automation Center (IAC)\n\nResponsibilities include:\n• Hands-on experience with Microsoft Copilot Studio, Microsoft Bot Framework, Azure Bot Services, and Power Virtual Agents (PVA).\n• Extensive hands-on experience in implementing end-to-end projects utilizing Generative AI using Retrieval-Augmented Generation (RAG) or Agentic architecture\n• Strong expertise in Python for building bot solutions\n• Experience with Azure Cognitive Services (LUIS\/CLU, QnA Maker\/CQA, Spell Check,Speech API) for advanced NLP features.\n• Knowledge of Power Automate, Azure Logic Apps, and APIs for extending PVA and bot functionalities.\n• Experience in software development with a focus on Conversational AI and Machine Learning.\n• Proficiency with tools and Frameworks such as LangChain, LlamaIndex, and Streamlit.\n• Knowledge and implementation experience of chatbot technologies using Microsoft Azure Services and Power Platform.\n• Ensure quality of coded components by performing thorough unit testing and develop reusable test cases\n• Work collaboratively with test teams for supporting Product testing and UAT\n• Report status, issues and risks to tech leads on a regular basis\n• Improve skills in automation products through certifications\n• Train and coach team members on Conversational AI related technologies\n• Work independently with minimal supervision and good team management skills\n• Excellent communication and collaboration skills\n• Provide timely status on assignments, planned activities, issues, and dependencies\n\n'• Knowledge of ChatBot technologies and implementation expereience using Microsoft Azure Services and Power Platform\n• Experience in Generative AI\n• Programming concepts and coding background in Python\n• Understanding of RDBMS concepts and writing SQL queries\n• Expereience in Cloud (preferrably Azure) and certifications is a plus\n• Experience in Agile development using standard tools like Jira\n• Any of the following skills will be a plus C#, .NET, Node.js, React\n\nMinimum Qualifications:\n• 3+ years of work experience in programming, scripting, and\/or automation or IT-relevant work experience with a Bachelor's degree.\n\nOR\n\n5+ years of work experience in programming, scripting, and\/or automation or IT-relevant work experience without a Bachelor’s degree.\n• 1+ year of experience with Database Design structures such as Mongo DB, MySQL.\n\nApplicants: Qualcomm is an equal opportunity employer. If you are an individual with a disability and need an accommodation during the application\/hiring process, rest assured that Qualcomm is committed to providing an accessible process. You may e-mail disability-accomodations@qualcomm.com or call Qualcomm's toll-free number found here. Upon request, Qualcomm will provide reasonable accommodations to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities. (Keep in mind that this email address is used to provide reasonable accommodations for individuals with disabilities. We will not respond here to requests for updates on applications or resume inquiries).\n\nQualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and\/or proprietary information, to the extent those requirements are permissible under applicable law.\n\nTo all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes\/applications.\n\nIf you would like more information about this role, please contact Qualcomm Careers.",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-Fbv64ro3LrrEfEDGAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/pwc.wd3.myworkdayjobs.com\/ko-KR\/Global_Experienced_Careers\/job\/Bangalore\/Conversational-AI-Developer---Senior-Associate_603401WD?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Conversational AI Developer - Senior Associate",
        "company":"PricewaterhouseCoopers Service Delivery Center (Bangalore) Private Limited",
        "location":"Bengaluru, Karnataka",
        "date_posted":1739145600000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"LoS Advisory 산업\/ 부문 Not Applicable 전문 분야 Data, Analytics & AI 채용 직급 Senior Associate 담당 업무 At PwC, our people in data and analytics focus on leveraging data to drive insights and make informed business decisions. They utilise advanced analytics techniques to help clients optimise their operations and achieve their strategic goals. In data analysis at PwC, you will focus on utilising advanced analytical techniques to extract insights from large datasets and drive data-driven decision-making. You will leverage skills in data manipulation, visualisation, and statistical modelling to support clients in solving complex business problems. Focused on relationships, you are building meaningful client connections, and learning how to manage and inspire others. Navigating increasingly complex situations, you are growing your personal brand, deepening technical expertise and awareness of your strengths. You are expected to anticipate the needs of your teams and clients, and to deliver quality. Embracing increased ambiguity, you are comfortable when the path forward isn’t clear, you ask questions, and you use these moments as opportunities to grow. Examples of the skills, knowledge, and experiences you need to lead and deliver value at this level include but are not limited to: Respond effectively to the diverse perspectives, needs, and feelings of others. Use a broad range of tools, methodologies and techniques to generate new ideas and solve problems. Use critical thinking to break down complex concepts. Understand the broader objectives of your project or role and how your work fits into the overall strategy. Develop a deeper understanding of the business context and how it is changing. Use reflection to develop self awareness, enhance strengths and address development areas. Interpret data to inform insights and recommendations. Uphold and reinforce professional and technical standards (e.g. refer to specific PwC tax and audit guidance), the Firm's code of conduct, and independence requirements. 학력 (미기재시, 요구되는 학위\/전공 없음) Degrees\/Field of Study required: Degrees\/Field of Study preferred: 전문 자격 (미기재시, 요구되는 전문 자격 없음) Required Skills Optional Skills Accepting Feedback, Accepting Feedback, Algorithm Development, Alteryx (Automation Platform), Analytic Research, Conducting Research, Creativity, Data Analysis Software, Data Collection, Data-Driven Insights, Data Pipeline, Data Quality Improvement Plans (DQIP), Data Warehouse, Embracing Change, Empathy, Inclusion, Information Gathering, Intellectual Curiosity, Key Performance Indicators (KPIs), Microsoft Power Query, Microsoft SQL Server Data Tools, Optimism, Power BI, Predictive Modelling, Python(프로그래밍 언어) {자세히(38)} 필요 언어 (미기재시, 요구되는 언어 없음) 출장 요건 Not Specified 취업비자 취득 지원 가능 여부 No 정부의 승인 여부가 필수 요건인지? No 입사지원 접수 마감일 You know us. We want to know you. Your career is just that; yours. You choose it. You live it. You make it happen.To get the best from it, you need the best opportunities. That’s why opportunities are at the heart of a career with us. Opportunities for you to grow as an individual, to build lasting relationships and make an impact in a place where people, quality and value mean everything.",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-g3ClTci_WtG0jXaIAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/startupgoa.org\/job\/avaamo-technologies-pvt-ltd-bengaluru-full-time-senior-conversational-ai-engineer\/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Senior Conversational AI engineer",
        "company":"Avaamo technologies pvt ltd",
        "location":"Bengaluru, Karnataka",
        "date_posted":null,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"We are a Conversational AI- Product Development company which is located in the USA, Bangalore.\n\nWe are looking for a senior developer to join the Avaamo Engineering team.\n\nTechnical Skills\n\nA. Mandatory Technical Skills\n\nHTML\/CSS\/JavaScript\n\nNode Js\n\nDatabases (MySQL OR PGSQL)\n\nData Modelling\n\nREST API\n\nWebhooks\n\nSOAP\/Web services\n\nB. Good to have Technical skills\n\n1. Knowledge of similar tools like https:\/\/zapier.com\/how-it- works\/\n\n2. Knowledge of similar tools like https:\/\/ifttt.com\/wtf\n\n3. Integration with Chat\/Social softwares like Facebook Messenger, Twitter, SMS\n\n4. Integration with Enterprise systems like Microsoft Dynamics CRM, Salesforce, Zendesk.\n\n5. Good understanding of HTTPS and Enterprise security\n\n6. Good understanding of Microsoft Active Directory.\n\nKey Responsibilities:\n\nIndependent team member for analysing requirements, designing, coding and and implementing Avaamo products (Enterprise Messaging and ChatBots)\n\nInteract with various teams at client site, develop and integrate ChatBots to various channels like FB, Twitter, Mobile App, Websites etc.\n\nWork closely with IT-Managers and Business Groups to gather requirements\n\nTranslates requirements into the required technical solution related to ChatBots\n\nStrong understanding of logical database design and development (SQL and NoSQL DBs)\n\nEvaluates reported defects and the correction of prioritized defects\n\nTrain other developers as per the need\n\nExcellent Communication Skills – 8\/10 a Must\n\nExperience with building chatBots is preferred very strongly\n\nAbility to learn latest technologies is a huge plus",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-uBsRmvNidYAY4Ab1AAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.linkedin.com\/jobs\/view\/hiring-for-conversational-ai-developer-senior-at-krazy-mantra-hr-solutions-3960986314?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Hiring For Conversational AI Developer (Senior)",
        "company":"krazy mantra hr solutions",
        "location":"Bagaluru, Karnataka",
        "date_posted":null,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":"career@krazymantra.com",
        "description":":\n\nConversational AI Developer (Senior)\n\nDesired Profile\n\nSkills: software development, Build experience using D4L or CML., Neo4j, Familiarity with tools like JIRA, Maven, GitHub, Docker, Jenkins\n\nExperience: 6-10 years, experience with NLP and Cognitive Services\n\nNotice Period: 0-30 days\n\nEducation: BE, BTech, ME, MTech, MCA (All Fulltime)\n\nLocation: Mumbai\/Bangalore\/Chennai\/Hyderabad\n\nEmail: career@krazymantra.com",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-aKElM4MmKiTTOWCyAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/pwc.wd3.myworkdayjobs.com\/ko-KR\/Global_Experienced_Careers\/job\/Conversational-AI-Developer--Senior-Associate_573846WD-3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Conversational AI Developer- Senior Associate",
        "company":"PricewaterhouseCoopers Service Delivery Center (Bangalore) Private Limited",
        "location":"Bengaluru, Karnataka",
        "date_posted":null,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"LoS Advisory 산업\/ 부문 Not Applicable 전문 분야 Data, Analytics & AI 채용 직급 Senior Associate 담당 업무 A career within Data and Analytics services will provide you with the opportunity to help organisations uncover enterprise insights and drive business results using smarter data analytics. We focus on a collection of organisational technology capabilities, including business intelligence, data management, and data assurance that help our clients drive innovation, growth, and change within their organisations in order to keep up with the changing nature of customers and technology. We make impactful decisions by mixing mind and machine to leverage data, understand and navigate risk, and help our clients gain a competitive edge. As part of our Analytics and Insights Consumption team, you’ll analyze data to drive useful insights for clients to address core business issues or to drive strategic outcomes. You'll use visualization, statistical and analytics models, AI\/ML techniques, Modelops and other techniques to develop these insights. Years of Experience: Candidates with 4+ years of hands on experience Required Skills: Familiarity with the Conversational AI domain, conversational design & implementation, customer experience metrics, and industry-specific challenges Understanding of conversational (chats, emails and calls) data and its preprocessing (including feature engineering if required) to train Conversational AI systems. Strong problem-solving and analytical skills to troubleshoot and optimize conversational AI systems. Familiarity with NLP\/NLG techniques such as parts of speech tagging, lemmatization, canonicalization, Word2vec, sentiment analysis, topic modeling, and text classification. NLP and NLU Verticals Expertise: Text to Speech (TTS), Speech to Text (STT), SSML modeling, Intent Analytics, Proactive Outreach Orchestration, OmniChannel AI & IVR (incl. Testing), Intelligent Agent Assist, Contact Center as a Service (CCaaS), Modern Data for Conversational AI and Generative AI. Experience building chatbots using bot frameworks like RASA\/ LUIS\/ DialogFlow\/Lex etc. and building NLU model pipeline using feature extraction, entity extraction, intent classification etc. Understanding and experience on cloud platforms (e.g., AWS, Azure, Google Cloud, Omilia Cloud Platform, Kore.ai, OneReach.ai, NICE, Salesforce, etc.) and their services for building Conversational AI solutions for clients Expertise in Python or PySpark. R and JavaScript framework. Expertise in visualization tools such as Power BI, Tableau, Qlikview, Spotfire etc. Experience with evaluating and improving conversational AI system performance through metrics and user feedback Excellent communication and collaboration skills to work effectively with cross-functional teams and stakeholders. Proven track record of successfully delivering conversational AI projects on time Familiarity with Agile development methodologies and version control systems. Ability to stay updated with the latest advancements and trends in conversational AI technologies. Strong strategic thinking and ability to align conversational AI initiatives with business goals. Knowledge of regulatory and compliance requirements related to conversational AI applications Experience in the telecom industry or a similar field Familiarity with customer service operations and CRM systems Nice to Have: Familiarity with data wrangling tools such as Alteryx, Excel and Relational storage (SQL) ML modeling skills: Experience in various statistical techniques such as Regression, Time Series Forecasting, Classification, XGB, Clustering, Neural Networks, Simulation Modelling, Etc. Experience in survey analytics, organizational functions such as pricing, sales, marketing, operations, customer insights, etc. Understanding of NoSQL databases (e.g., MongoDB, Cassandra) for handling unstructured and semi-structured data. Good Communication and presentation skills 학력 (미기재시, 요구되는 학위\/전공 없음) Degrees\/Field of Study required: Degrees\/Field of Study preferred: 전문 자격 (미기재시, 요구되는 전문 자격 없음) Required Skills Optional Skills 필요 언어 (미기재시, 요구되는 언어 없음) 출장 요건 0% 취업비자 취득 지원 가능 여부 No 정부의 승인 여부가 필수 요건인지? No 입사지원 접수 마감일 October 16, 2024 You know us. We want to know you. Your career is just that; yours. You choose it. You live it. You make it happen.To get the best from it, you need the best opportunities. That’s why opportunities are at the heart of a career with us. Opportunities for you to grow as an individual, to build lasting relationships and make an impact in a place where people, quality and value mean everything.",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-nrkIUUHUxT1OqomzAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/www.hirist.tech\/j\/koreai-developer-ivr-technologies-smartassist-xo-platform-5-8-yrs-1392416.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Kore.AI Developer - IVR Technologies - SmartAssist\/XO Platform",
        "company":"Risk Resources India",
        "location":"Bengaluru, Karnataka",
        "date_posted":null,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Must Have :\n\nTechnical\/Functional Skills : KORE.ai SmartAssist and XO Platform, Java, Java Script, Python, XML, Web Services API, Analytical, Problem Solving and Coordination Skills, AWS, IVR Systems Awareness (Genesys\/Alvaria), NLP Awareness\n\nExperience Required Technology requirements :\n\n- Min 2+ yrs hands on KORE.ai (SmartAssist and XO Platform), IVR Technologies (like Gensys and Alvaria), Java, Java Script, Python\n\n- Good understand on Conversational AI Platform\n\n- Exposure to Gen AI and NLP aspects\n\n- Good experience in understanding the business requirements and creating chatbots as well as conversational bots\n\n- Experience on Node Js used for chatbot backend technology\n\n- Hands-on experience with full cycle of Bot development - Blueprinting, Dialog Tasks, Entity Extraction ,NLP, API Management, Testing(Batch Cycle) and Deployment.\n\n- Strong understanding of Analyze features on trends, analysis of Bot usage\n\nRoles & Responsibilities :\n\n- Develop and design the technical solution in line with Client functional specifications.\n\n- Validate the technical solution and confirm if it works as per requirement. Ability to use simulation and testing tools of Kore.ai\n\n- Work with Kore's development and QA testing teams to deliver the technical solution.\n\n- Implement and deliver bot-based solutions for the client as per business requirements",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-MVn8N8guuXhXlfzbAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.indeed.com\/viewjob?jk=8260bcb2f95edad8&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Lead Chatbot Developer - Conversational AI",
        "company":"Digit88 Technologies",
        "location":"Karnataka",
        "date_posted":null,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"About Digit88\n\nDigit88 empowers digital transformation for innovative and high growth B2B and B2C SaaS\ncompanies as their trusted offshore software product engineering partner!\n\nWe are a lean mid-stage software company, with a team of 75+ fantastic technologists, backed by\nexecutives with deep understanding of and extensive experience in consumer and enterprise product development across large corporations and startups. We build highly efficient and effective engineering teams that solve real and complex problems for our partners.\n\nWith more than 50+ years of collective experience in areas ranging from B2B and B2C SaaS, web and mobile apps, e-commerce platforms and solutions, custom enterprise SaaS platforms and domains spread across Conversational AI, Chatbots, IoT, Health-tech, ESG\/Energy Analytics, Data Engineering, the founding team thrives in a fast paced and challenging environment that allows us to\nshowcase our best.\n\nThe Mission: To create digital experiences that are Curiously Human\nThe Product: Award winning, World's No.1 AI based messaging platform that makes it easy\nfor consumers to buy products and get answers to their questions\n\nThe Opportunity\n\nDigit88 manages and is expanding the dedicated offshore product development team for its US (Bay Area, NYC) based NLP\/Chatbot platform development partner, that is building a next-generation AI\/NLP\/Chatbots based customer engagement platform. You would be working directly with a world class team of executives who excel at creating world class products.\n\nJob Profile\n\nDigit88 is seeking a Lead Chatbot Developer to join our Chatbots development team. As the Lead Bot Developer, you will participate in project design and development stages from the concept to final hand-off to the customer, demonstrating technical leadership in the conversational AI domain.\n\nResponsibilities:\n• Prepare Chatbot storyboards, user\/process flows to effectively communicate interaction and design ideas.\n• You will Develop, Debug and Deploy conversational Chatbot experiences using appropriate client platform and tools\n• Discuss development and key milestone deliverables with peers, executives and executive-level client stakeholders.\n• Participate in creating guidelines, best practices and standards of Chatbot-featured deliverables.\n• Keep abreast of the latest Chatbot trends, techniques, and technologies\n• Perform demonstrations for client stakeholders on project features and sub features, which utilizes Chatbot solutions.\n• Technically leading the development team, visibly demonstrating technical leadership and provide technical oversight to the team ensuring seamless deliverables.\n\nRequirements:\n• Minimum 5 years of professional development experience\n• Experience designing and developing Chatbots for various channels (web, Facebook Messenger, SMS, etc) using bot platforms or raw code is desired\n• Extremely strong JavaScript skills\n• Experience with one or more of backend technologies - Node, PHP, Python, Java is a big plus\n• Experience working with REST APIs and JSON\n• Portfolio showcasing excellent development skills and demonstrating problem-solving skills\n• Experience in creating workflows, storyboards, user flows, process flows and site maps.\n• Knowledge and experience in some of the key AI platforms - Facebook Wit.Ai, Google DialogFlow, Microsoft Luis, IBM Watson is a big plus\n\nAdditional Project\/Soft Skills:\n• Strong verbal and written communication with ability to articulate problems and solutions over the phone and emails.\n• Strong sense of urgency, with a passion for accuracy and timeliness.\n• Ability to work calmly in high pressure situations and manage multiple projects\/tasks.\n• Ability to work independently and possess superior skills in issue resolution.\n\nBenefits\/Culture @ Digit88:\n• Comprehensive Insurance (Life, Health, Accident)\n• Flexible Work Model\n• Accelerated learning & non-linear growth\n• Flat organisation structure driven by ownership and accountability.\n• Global Peers - Working with some of the best engineers\/professionals globally from the likes of Apple, Amazon, IBM Research, Adobe and other innovative product companies\n• Ability to make a global impact with your work, leading innovations in Conversational AI, Tele-Medicine, Healthcare and more.\n\nYou will work with a founding team of serial entrepreneurs with multiple successful exits to their credit. The learning will be immense just as will the challenges.\n\nThis is the right time to join us and partner in our growth!\n\nHiring organization\n\nJob Location\n\nBengaluru, India\n\nEmployment Type\n\nFull-time\n\nExperience\n\n5 - 7 Years",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4142470847",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4142470847",
        "job_url_direct":"https:\/\/careers.lilly.com\/us\/en\/job\/LILLUSR79496EXTERNALENUS\/AI-ChatBot-Developer?utm_source=linkedin&utm_medium=phenom-feeds%2Fapply&source=linkedin&urlHash=2749",
        "title":"AI ChatBot Developer",
        "company":"Eli Lilly and Company",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":1740441600000,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"mid-senior level",
        "job_function":"Engineering and Information Technology",
        "listing_type":null,
        "emails":null,
        "description":"At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our employees around the world work to discover and bring life\\-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.\n   \n\n  \n\n**Detailed Description**\n At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees work to discover and bring life\\-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the globe.As a AI ChatBot Developer you should be able to design, develop and deploy conversational agents that can interact with humans in natural language.\n   \n\n  \n\n* Competency :\n\n\n Lead AI ChatBot Developer\n   \n\n  \n\n* This position is for an expert in NLP and Text Processing to help us develop applications that automate communication and customer services.You will use Artificial Intelligence, NLP technologies, and cognitive machine learning to develop chatbot applications and also integrate solution with multiple platforms.You will also manage the data coming from chatbot conversations and analyse them. You will identify, analyze, and interpret the pattern, trends, and conversational flow in complex data sets. You should demonstrate an increased focus on customer engagement and should possess working knowledge of Frontend Technologies\\-– HTML, CSS, JavaScript, JSON, and REST APIs.\n\n\n**Key Skills Required**\n* 5\\+ years hands on experience with chatbot development platforms and services (e.g., Kore.ai, Yellow.ai, Dialogflow, Microsoft Bot Framework, IBM Watson).\n* Strong programming skills in languages such as JSON, Microsoft Azure, Python, Java, JavaScript, etc.\n* Prior experience on hosting chatbots on multiple channels( teams, slack, sharepoint,web portal)\n* 5\\+ years of experience in developing and deploying using either Azure or AWS services\n* Familiarity with Generative AI services and RAG and Agentic applications .\n* Excellent problem\\-solving skills and attention to detail.\n* Ability to work collaboratively in a global team environment.\n* Strong communication skills to convey technical concepts effectively to non\\-technical people.\n* Experience with version control systems (e.g., Git) and CI\/CD practices.\n* Experience with testing and quality control.\n\n\n Bachelor's or Master’s degree in Computer Science, Artificial Intelligence, or a related field\n   \n\n  \n\n**Key Responsibilities Include**\n* Develop robust and scalable conversational AI chatbots utilising Kore.ai or equivalent platforms tailored to specific Lilly Service Desks requirements.\n* Collaborate with cross\\-functional teams to gather requirements, design conversational flows, and implement natural language processing (NLP) algorithms.\n* Design and integrate chatbots with various platforms and applications, ensuring seamless user experiences.\n* Conduct rigorous testing and debugging of chatbot functionalities to ensure high performance and accuracy.\n* Optimize chatbot responses based on user interactions, feedback, and data analysis.\n* Work closely with conversational UI designers to create visually appealing and user\\-friendly chatbot interfaces.\n* Provide technical guidance and support to internal teams regarding chatbot integration and customization.\n* Document chatbot development processes, algorithms, and code for future reference and collaboration.\n* Collaborate with stakeholders to understand business requirements, prioritise scope and translate requirements into technical specifications for chatbot development.\n\n\n**Basic Qualifications**\n* Master's in computer science, Statistics, Computer Engineering, Electrical Engineering, Information Science, Information Engineering or related field\n* 5\\+ years of experience in NLP and chatbot development\n* Deep understanding of NLP techniques and systems\n\n\n**Additional Information**\n* Make the impossible possible in your quest to make life better.\n* Bring Analytics to life by giving it zeal and making it applicable to our business.\n* Know, learn, and keep up to date on the analytical, computational and scientific advances to maximize your impact.\n* Bring an insatiable desire to learn, to innovate, and to challenge yourself for the benefit of patients.\n* Thoroughly know conversational AI and machine learning concepts to build advanced bots.\n\n\n**Desirable Skills**\n* In\\-depth knowledge of natural language processing (NLP) algorithm and frameworks (e.g., NLTK, spaCy, TensorFlow).\n* Highly motivated\/self\\-starter with a sense of ownership, willingness to learn, and desire to succeed\n* Strong teamwork, problem\\-solving, and analytical skills\n* Deep knowledge of math, probability, statistics and algorithms\n* Strong understanding of Pharma Quality Standards and Practices\n* Excellent leadership and interpersonal skills (both verbal and written)\n\n\n Lilly is dedicated to helping individuals with disabilities to actively engage in the workforce, ensuring equal opportunities when vying for positions. If you require accommodation to submit a resume for a position at Lilly, please complete the accommodation request form (https:\/\/careers.lilly.com\/us\/en\/workplace\\-accommodation) for further assistance. Please note this is for individuals to request an accommodation as part of the application process and any other correspondence will not receive a response.\n   \n\n  \n\n Lilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n   \n\n  \n\n \\#WeAreLilly",
        "company_industry":"Pharmaceutical Manufacturing",
        "company_url":"https:\/\/www.linkedin.com\/company\/eli-lilly-and-company",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQG9tk5c8FBQUg\/company-logo_100_100\/company-logo_100_100\/0\/1719941589682\/eli_lilly_and_company_logo?e=2147483647&v=beta&t=dAAxBNYbZCCl6r0uRyJfaAPGTVppTRphsfWoM5W4gJQ",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4167830663",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4167830663",
        "job_url_direct":"https:\/\/zycus.sensehq.com\/careers\/jobs\/56878&urlHash=GI8u",
        "title":"Machine Learning Engineer",
        "company":"Zycus",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":1740441600000,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"mid-senior level",
        "job_function":"Information Technology and Engineering",
        "listing_type":null,
        "emails":null,
        "description":"**About Us**\n Zycus is a pioneer in Cognitive Procurement software and has been a trusted partner of choice for large global enterprises for two decades. Zycus has been consistently recognized by Gartner, Forrester, and other analysts for its Source to Pay integrated suite. Zycus powers its S2P software with the revolutionary Merlin AI Suite. Merlin AI takes over the tactical tasks and empowers procurement and AP officers to focus on strategic projects; offers data\\-driven actionable insights for quicker and smarter decisions, and its conversational AI offers a B2C type user\\-experience to the end\\-users.\n   \n\n  \n\n Zycus helps enterprises drive real savings, reduce risks, and boost compliance, and its seamless, intuitive, and easy\\-to\\-use user interface ensures high adoption and value across the organization.\n   \n\n  \n\n Start your \\#CognitiveProcurement journey with us, as you are \\#MeantforMore\n   \n\n  \n\n****We Are An Equal Opportunity Employer:****\n Zycus is committed to providing equal opportunities in employment and creating an inclusive work environment. We do not discriminate against applicants on the basis of race, color, religion, gender, sexual orientation, national origin, age, disability, or any other legally protected characteristic. All hiring decisions will be based solely on qualifications, skills, and experience relevant to the job requirements.\n   \n\n  \n\n**Job Description**\n We are seeking a highly skilled and motivated\n **Machine Learning Engineers** \n to join our dynamic team. The ideal candidate will have a strong background in machine learning, data science, and software development, with proficiency in Java\n **or** \n Python programming stacks. Additionally, the candidate should have experience with NoSQL databases and cloud technologies. Successful candidates must have a proven track record of solving industry problems and possess 2\\-5 years of relevant experience.\n   \n\n  \n\n****Responsibilities:****\n* Develop and implement machine learning models and algorithms to address complex business challenges.\n* Analyze large datasets to extract meaningful insights and drive data\\-driven decision making.\n* Collaborate with cross\\-functional teams to design and build scalable data solutions.\n* Utilize Java or Python programming stacks to develop and maintain software applications.\n* Work with NoSQL databases to store and manage unstructured data efficiently.\n* Deploy and manage applications on cloud platforms such as AWS, Azure, or Google Cloud.\n* Continuously research and stay updated with the latest advancements in machine learning and data science technologies.\n* Document processes, models, and code to ensure knowledge sharing and maintainability.\n\n\n Job Requirement\n   \n\n  \n\n****Preferred Candidate Would Have:****\n* 2\\-5 years of experience in machine learning, data science, or related roles.\n* Proficiency in Java or Python programming stacks.\n* Should be able Deliver End to End AI based solution.\n* Must have experience in GenAI.\n* Experience with NoSQL databases such as MongoDB, Cassandra, or Couchbase.\n* Familiarity with cloud technologies, including AWS, Azure, or Google Cloud.\n* Strong problem\\-solving skills and the ability to work independently and collaboratively.\n* Excellent communication skills and the ability to convey complex technical concepts to non\\-technical stakeholders.\n* Proven ability to analyze large datasets and derive actionable insights.\n* Education criteria \\- Bachelor’s or master’s degree in computer science, Machine learning or Data Science, or a related field.\n\n\n****Preferred Expertise:****\n* Experience in deploying machine learning models in a production environment.\n* Knowledge of big data technologies such as Hadoop, Spark, or Kafka.\n* Familiarity with containerization technologies such as Docker and Kubernetes.\n* Experience with version control systems like Git.\n* Proficiency in Java or Python Full Stack Development.\n* Proficiency in SDLC\n* Proficiency in Data Structures.\n* Proficiency in Database Technologies.\n* Proficiency in GenAi python Stack for Development.\n\n\n****Five Reasons Why You Should Join Zycus:****\n* Cloud Product Company: We are a Cloud SaaS Company, and our products are created by using the latest technologies like ML and AI. Our UI is in Angular JS, and we are developing our mobile apps using React.\n* A Market Leader: Zycus is recognized by Gartner (world’s leading market research analyst) as a Leader in Procurement Software Suites.\n* Move between Roles: We believe that change leads to growth and therefore we allow our employees to shift careers and move to different roles and functions within the organization\n* Get a Global Exposure: You get to work and deal with our global customers.\n* Create an Impact: Zycus gives you the environment to create an impact on the product and transform your ideas into reality. Even our junior engineers get the opportunity to work on different product features.\n\n\n****About Us****\n Zycus is a pioneer in Cognitive Procurement software and has been a trusted partner of choice for large global enterprises for two decades. Zycus has been consistently recognized by Gartner, Forrester, and other analysts for its Source to Pay integrated suite. Zycus powers its S2P software with the revolutionary Merlin AI Suite. Merlin AI takes over the tactical tasks and empowers procurement and AP officers to focus on strategic projects; offers data\\-driven actionable insights for quicker and smarter decisions, and its conversational AI offers a B2C type user\\-experience to the end\\-users. Zycus helps enterprises drive real savings, reduce risks, and boost compliance, and its seamless, intuitive, and easy\\-to\\-use user interface ensures high adoption and value across the organization.\n   \n\n  \n\n Start your \\#CognitiveProcurement journey with us, as you are \\#MeantforMore",
        "company_industry":"IT Services and IT Consulting and Software Development",
        "company_url":"https:\/\/www.linkedin.com\/company\/zycus",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D4D0BAQF2xi0a3f_zEA\/company-logo_100_100\/B4DZT5KSRqG8AY-\/0\/1739347011220\/zycus_logo?e=2147483647&v=beta&t=6Keq11CosE2K_49lAAcwvqeDWEDfIaeeUmrG2hTQIUY",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4157319167",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4157319167",
        "job_url_direct":"https:\/\/jda.wd5.myworkdayjobs.com\/JDA_Careers\/job\/Bangalore\/Automation-AI-Engineer_250072?source=LinkedIn&urlHash=DHPO",
        "title":"Automation AI Engineer",
        "company":"Blue Yonder",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":1740441600000,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"not applicable",
        "job_function":"Management, Information Technology, and Engineering",
        "listing_type":null,
        "emails":null,
        "description":"**Overview**\n Job Description\n   \n\n  \n\n Leading AI\\-driven Global Supply Chain Solutions Software Product Company and one of Glassdoor’s “Best Places to Work.”\n   \n\n  \n\n Seeking an astute individual that has a strong technical foundation with ability to be hands\\-on on developing\/building automation to improve efficiency, productivity, and customer experience. Deep knowledge of industry best practices, with the ability to implement them working with larger team cloud, support, and the product teams.\n   \n\n  \n\n**Scope**\n We are seeking a highly skilled AI\/Prompt Engineer to design, implement, and maintain artificial intelligence (AI) and machine learning (ML) solutions for our organization. The ideal candidate will have a deep understanding of AI and ML technologies, as well as experience with data analysis, software development, and cloud computing.\n   \n\n  \n\n**Primary Responsibilities**\n Design and implement AI\/ conversational AI solutions and ML solutions to solve business problems and to improve customer experience and operational efficiency.\n   \n\n  \n\n Develop and maintain machine learning models using tools such as TensorFlow, Keras, and PyTorch\n   \n\n  \n\n Collaborate with cross\\-functional teams to identify opportunities for AI and ML solutions and develop prototypes and proof\\-of\\-concepts.\n   \n\n  \n\n Develop and maintain data pipelines and ETL processes to support AI and ML workflows.\n   \n\n  \n\n Monitor and optimize model performance, accuracy, and scalability\n   \n\n  \n\n Stay up to date with emerging AI and ML technologies and evaluate their potential impact on our organization.\n   \n\n  \n\n Develop and maintain technical documentation, including architecture diagrams, design documents, and standard operating procedures\n   \n\n  \n\n Provide technical guidance and mentorship to other members of the data engineering and software development teams.\n   \n\n  \n\n Develop and maintain chatbots and voice assistants using tools such as Dialogflow, Amazon Lex, and Microsoft Bot Framework\n   \n\n  \n\n Develop and maintain integrations with third\\-party systems and APIs to support conversational AI workflows.\n   \n\n  \n\n Develop and maintain technical documentation, including architecture diagrams, design documents, and standard operating procedures.\n   \n\n  \n\n Provide technical guidance and mentorship to other team members.\n   \n\n  \n\n**What We Are Looking For**\n Bachelor’s degree in computer science, Information Technology, or a related field with 3\\+ years of experience in conversational AI engineering, design, and implementation\n   \n\n  \n\n Strong understanding of NLP technologies, including intent recognition, entity extraction, and sentiment analysis\n   \n\n  \n\n Experience with software development, including proficiency in Python and familiarity with software development best practices and tools (Git, Agile methodologies, etc.)\n   \n\n  \n\n Familiarity with cloud computing platforms (AWS, Azure, Google Cloud) and related services (S3, EC2, Lambda, etc.)\n   \n\n  \n\n Experience with big data technologies (Hadoop, Spark, etc.)\n   \n\n  \n\n Experience with containerization (Docker, Kubernetes)\n   \n\n  \n\n Experience with data visualization tools (Tableau, Power BI, etc.)\n   \n\n  \n\n Experience with reinforcement learning and\/or generative models.\n   \n\n  \n\n Experience with machine learning technologies and frameworks (TensorFlow, Keras, etc.)\n   \n\n  \n\n Experience with big data technologies (Hadoop, Spark, etc.)\n   \n\n  \n\n Strong communication and collaboration skills\n   \n\n  \n\n Strong attention to detail and ability to prioritize tasks effectively.\n   \n\n  \n\n Strong problem\\-solving and analytical skills\n   \n\n  \n\n Ability to work independently and as part of a team.\n   \n\n  \n\n Strong attention to detail and ability to prioritize tasks effectively.\n   \n\n  \n\n Experience working with cloud platforms like AWS, Google Cloud, or Azure.\n   \n\n  \n\n Knowledge of big data technologies such as Apache Spark, Hadoop, or Kafka is a plus.\n   \n\n  \n\n Strong problem\\-solving and analytical skills.\n   \n\n  \n\n Ability to work in an agile and fast\\-paced development environment.\n   \n\n  \n\n**Our Values**\n If you want to know the heart of a company, take a look at their values. Ours unite us. They are what drive our success – and the success of our customers. Does your heart beat like ours? Find out here: Core Values\n   \n\n  \n\n Diversity, Inclusion, Value \\& Equity (DIVE) is our strategy for fostering an inclusive environment we can be proud of. Check out Blue Yonder's inaugural Diversity Report which outlines our commitment to change, and our video celebrating the differences in all of us in the words of some of our associates from around the world.\n   \n\n  \n\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.",
        "company_industry":"Software Development, IT Services and IT Consulting, and Information Services",
        "company_url":"https:\/\/www.linkedin.com\/company\/blueyonder",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQFiDXXuM80LbQ\/company-logo_100_100\/company-logo_100_100\/0\/1715093188007\/blueyonder_logo?e=2147483647&v=beta&t=_KgNIoeFQWR-7P5i9WYiAG7rM2Sn4FwcSrx-PILTifk",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4166777997",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4166777997",
        "job_url_direct":"https:\/\/www.expertia.ai\/modusetp\/job\/hiring-ai-developer-676acc50a662dd8ad65dc196?utm_source=linkedin-feed&easy_apply=true&date-refresh=02\/27\/2025&urlHash=igD3",
        "title":"AI Developer",
        "company":"Modus Enterprise Transformation Platform",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":null,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"associate",
        "job_function":"Engineering",
        "listing_type":null,
        "emails":"shambhavi.tewari@modusetp.com",
        "description":"**Skills:**\n Statistical Analysis, Machine Learning, Python Programming, Data Visualization, Predictive Modeling, Big Data, SQL, Data Mining,\n   \n\n  \n\n**Walk in Drive: From 26th December to 27th December**\n**Time: 10:00 AM till 06:00 PM**\n**Job Description: Junior AI Developer**\n**Position:** \n Junior AI Developer\n   \n\n  \n\n**Experience:** \n 1\\-3 Years\n   \n\n  \n\n**Location:** \n Bangalore (Koramangala)\n   \n\n  \n\n 96, 3rd Cross, 7th Block Koramangala Bangalore, Bangalore, Karnataka 560095\n   \n\n  \n\n**Job Type:** \n Hybrid \\- Permanent\n   \n\n  \n\n**Company Name:** \n Modus Enterprise Transformation Platform\n   \n\n  \n\n**About Modus**\n Modus Enterprise Transformation Platform is a leader in delivering cutting\\-edge solutions for enterprise innovation and transformation. We leverage advanced AI technologies to drive business excellence and create impactful change. Join our team and contribute to building next\\-generation AI systems that revolutionize the way enterprises operate.\n   \n\n  \n\n**Role Overview**\n We are looking for a dynamic and skilled\n **Junior AI Developer** \n to join our AI team in Bangalore. The ideal candidate will have hands\\-on experience in building intelligent chatbots, adopting and customizing AI models such as OpenAI, LLAMA, RAG, and Graph RAG, and contributing to Generative AI (GenAI), Large Language Models (LLM), and Artificial General Intelligence (AGI) projects. This role also involves assisting in team leadership and project execution.\n   \n\n  \n\n**Key Responsibilities**\n* Chatbot Development: Build and deploy conversational AI systems tailored to enterprise needs.\n* AI Model Integration: Work with models like OpenAI, LLAMA, RAG, and Graph RAG to adopt, fine\\-tune, and implement AI solutions.\n* Generative AI Projects: Design and develop generative AI applications for innovative business use cases.\n* LLM Expertise: Optimize and integrate large language models into various enterprise applications.\n* AGI Exploration: Contribute to research and development in Artificial General Intelligence concepts.\n* Team Collaboration: Collaborate with cross\\-functional teams to ensure the successful delivery of AI projects.\n* Team Leadership: Assist in mentoring junior team members, promoting knowledge sharing, and supporting project leadership efforts.\n\n\n**Must\\-Have Skills**\n* Generative AI (GenAI): Proven experience in developing and implementing generative AI solutions.\n* Large Language Models (LLM): Strong knowledge of working with LLM architectures and techniques.\n* Artificial General Intelligence (AGI): Basic understanding of AGI principles and eagerness to contribute to AGI\\-related projects.\n* Model Adoption: Practical experience with AI model customization, including OpenAI, LLAMA, RAG, and Graph RAG.\n* Chatbot Development: Experience in designing and deploying chatbots for complex use cases.\n* Team Leadership: Demonstrated ability to guide and mentor team members, fostering collaboration and innovation.\n\n\n**Preferred Qualifications**\n* Bachelors or Masters degree in Computer Science, Artificial Intelligence, or a related field.\n* Proficiency in AI development frameworks such as TensorFlow or PyTorch.\n* Familiarity with cloud platforms (AWS, Azure, or Google Cloud) for AI deployment.\n* Strong programming skills in Python or other relevant languages.\n* Excellent problem\\-solving and communication skills.\n\n\n**What We Offer**\n* A hybrid work model combining the best of in\\-office and remote flexibility.\n* Opportunities to work on groundbreaking AI projects in a supportive and innovative environment.\n* Continuous learning and development programs to enhance your AI expertise.\n* Competitive salary and benefits package.\n\n\n Interested candidate can share cv on\n **shambhavi.tewari@modusetp.com for any query contact on email id.**",
        "company_industry":"Business Consulting and Services",
        "company_url":"https:\/\/uk.linkedin.com\/company\/modus-business-transformation",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D4E0BAQHkN8ydMoFZJA\/company-logo_100_100\/company-logo_100_100\/0\/1698945280117\/modus_business_transformation_logo?e=2147483647&v=beta&t=0OWEAtWmVCj8tCUSMXvcJuJ_iL-fp0DraVuG65AClOY",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4168496354",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4168496354",
        "job_url_direct":"https:\/\/wellfound.com\/jobs\/3221991-solutions-engineer-conversational-ai-chatbots?utm_campaign=linkedin_syndication&utm_source=linkedin&urlHash=SMld",
        "title":"Solutions Engineer - Conversational AI\/Chatbots",
        "company":"Digit88 Technologies",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":null,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"mid-senior level",
        "job_function":"Engineering and Information Technology",
        "listing_type":null,
        "emails":null,
        "description":"**About Digit88\/The Opportunity**\n Digit88 is a boutique software product engineering company based out of Bangalore since 2014\\. Over the years, we have established and managed 12\\+ high performance product engineering teams in the areas ofAI\/Conversational AI\/Tele\\-health\/Healthcare systems\/Logistics\/E\\-commerce and more.\n   \n\n  \n\n Since 2016, we have partnered with one of the world's foremost Conversational AI companies to set up their dedicated product engineering team in India. Over the past 5\\+ years we have been collaboratively engineering highly scalable, high performance, resilient platforms with teams in Seattle, Mountain View, UK, Israel and Germany.\n   \n\n  \n\n Founded in New York City with over 1,200\\+ employees spanning 6 continents and dozens of countries, our partner is a transformational force in how brands and consumers communicate. With over 18,000 brands, including HSBC, Disney, Verizon, and Home Depot using the platforms that we are developing, our partner is a market leader in Conversational AI competing with the likes of Google Dialog Flow, IBM Watson, Microsoft and more.\n   \n\n  \n\n You would be joining an existing team of 50\\+ professionals and help expand the Conversational AI professional services team that builds and delivers highly engaging and cutting edge chatbot\/AI solutions that automate and power millions of conversations daily across the world.\n   \n\n  \n\n**Job Profile**\n Digit88 is seeking a Chatbot Developer to join our Chatbots development team. As a Bot Developer, you will participate in project design and development stages from the concept to final hand\\-off to the customer.\n   \n\n  \n\n**Responsibilities**\n* Prepare Chatbot storyboards, user\/process flows to effectively communicate interaction and design ideas.\n* You will Develop, Debug and Deploy conversational Chatbot experiences using appropriate client platform and tools\n* Discuss development and key milestone deliverables with peers, executives and executive\\-level client\n* stakeholders.\n* Participate in creating guidelines, best practices and standards of Chatbot\\-featured deliverables.\n* Keep abreast of the latest Chatbot trends, techniques, and technologies\n* Perform demonstrations for client stakeholders on project features and sub features, which utilizes Chatbot solutions.\n\n\n**Requirements**\n* Minimum 3\\-5 years of professional development experience\n* Experience designing and developing Chatbots for various channels (web, Facebook Messenger, SMS, etc) using bot platforms or raw code is desired\n* Extremely strong JavaScript skills\n* Experience working with REST APIs and JSON\n* Portfolio showcasing excellent development skills and demonstrating problem\\-solving skills\n* Experience in creating workflows, storyboards, user flows, process flows and site maps.\n* Experience with one or more of backend technologies \\- Node, PHP, Python, Java is a big plus\n* Knowledge and experience in some of the key AI platforms \\- Facebook Wit.Ai, Google DialogFlow, Microsoft Luis, IBM Watson is a big plus\n\n\n**Additional Project\/Soft Skills**\n* You are a creative problem solver\n* Positive attitude and self\\-motivated\n* Proficiency in current web design technology\n* Extremely detail\\-oriented and also able to see the big picture\n* Excellent written and verbal communication skills and presentation ability\n* Strong visual design skills with good understanding of user\\-system interaction\n* Strong presentations skills and team player abilities\n* Strong problem\\-solving skills with creative approach\n\n\n**Benefits working @ Digit88:**\n* Group Health \\& Accident Insurance\n* Flexible Work Arrangements\/Remote Work\n* Profit Share Opportunities\n* Accelerated learning \\& non\\-linear growth\n* Flat organisation structure\n* Global Peers \\- Working with some of the best engineers\/professionals globally from the likes of Apple, Amazon, IBM and other innovating product companies\n* Ability to make a global impact with your work, leading innovations in Conversational AI, Tele\\-Medicine, Healthcare and more\n\n\n You will work with a founding team of serial entrepreneurs with multiple successful exits to their credit.\n   \n\n  \n\n The learning will be immense just as will the challenges.\n   \n\n  \n\n This is the right time to join us and partner in our early growth!",
        "company_industry":"IT Services and IT Consulting",
        "company_url":"https:\/\/in.linkedin.com\/company\/digit88-technologies",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQEQFX7toJ8gXg\/company-logo_100_100\/company-logo_100_100\/0\/1708091580088\/digit88_technologies_logo?e=2147483647&v=beta&t=J1DJbhLhDE8-4o9-VuXp2qkDnunv6VI1yEKGSM_VOeE",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4168373998",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4168373998",
        "job_url_direct":"https:\/\/pwc.wd3.myworkdayjobs.com\/Global_Experienced_Careers\/job\/Bengaluru-Millenia\/IN-Senior-Associate-Conversational-AI-Developer-Advisory-Corporate-Advisory-Mumbai_591834WD-1\/?source=LinkedIn&urlHash=ktUO",
        "title":"IN_Senior Associate_Conversational AI Developer_Advisory Corporate_Advisory_Bangalore",
        "company":"PwC India",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":null,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"mid-senior level",
        "job_function":"Engineering and Information Technology",
        "listing_type":null,
        "emails":null,
        "description":"**Line of Service**\n Advisory\n   \n\n  \n\n**Industry\/Sector**\n Not Applicable\n   \n\n  \n\n**Specialism**\n SAP\n   \n\n  \n\n**Management Level**\n Senior Associate\n   \n\n  \n\n**Job Description \\& Summary**\n At PwC, our people in data and analytics engineering focus on leveraging advanced technologies and techniques to design and develop robust data solutions for clients. They play a crucial role in transforming raw data into actionable insights, enabling informed decision\\-making and driving business growth.\n   \n\n  \n\n Those in artificial intelligence and machine learning at PwC will focus on developing and implementing advanced AI and ML solutions to drive innovation and enhance business processes. Your work will involve designing and optimising algorithms, models, and systems to enable intelligent decision\\-making and automation.\n   \n\n  \n\n* Why PWC\n\n\n At PwC, you will be part of a vibrant community of solvers that leads with trust and creates distinctive outcomes for our clients and communities. This purpose\\-led and values\\-driven work, powered by technology in an environment that drives innovation, will enable you to make a tangible impact in the real world. We reward your contributions, support your wellbeing, and offer inclusive benefits, flexibility programmes and mentorship that will help you thrive in work and life. Together, we grow, learn, care, collaborate, and create a future of infinite experiences for each other. Learn more about us.\n   \n\n  \n\n At PwC, we believe in providing equal employment opportunities, without any discrimination on the grounds of gender, ethnic background, age, disability, marital status, sexual orientation, pregnancy, gender identity or expression, religion or other beliefs, perceived differences and status protected by law. We strive to create an environment where each one of our people can bring their true selves and contribute to their personal growth and the firm’s growth. To enable this, we have zero tolerance for any discrimination and harassment based on the above considerations. \"\n   \n\n  \n\n**Job Description \\& Summary:** \n A career within…. A career within Application and Emerging Technology services will provide you with the opportunity to help organisations uncover enterprise insights and drive business results using smarter data analytics. We focus on a collection of organisational technology capabilities, including business intelligence, data management, and data assurance that help our clients drive innovation, growth, and change within their organisations in order to keep up with the changing nature of customers and technology. We make impactful decisions by mixing mind and machine to leverage data, understand and navigate risk, and help our clients gain a competitive edge\n   \n\n  \n\n Job Summary: We are seeking a highly skilled Conversational AI Developer to join our team. In this role, you will be responsible for developing and implementing conversational AI solutions that enhance customer engagement and improve business operations. The ideal candidate will have a strong background in software development, as well as experience with natural language processing and machine learning.\n   \n\n  \n\n**Responsibilities**\n* Develop and implement conversational AI solutions that meet client needs.\n* Build and train natural language processing models to improve accuracy and understanding.\n* Design and develop conversational interfaces that are intuitive and easy for users to navigate.\n* Work with cross\\-functional teams to integrate conversational AI solutions into existing systems.\n* Troubleshoot and resolve technical issues related to conversational AI solutions.\n* Stay up\\-to\\-date with the latest developments in conversational AI and identify new opportunities for growth and innovation.\n\n\n**Requirements**\n* Bachelor's degree in computer science or a related field.\n* 2\\+ years of experience in software development, with a focus on conversational AI.\n* Strong understanding of natural language processing and machine learning.\n* Strong Experience with programming languages such as NodeJS, C\\#, Python, Java, or JavaScript.\n* Experience with chatbot platforms such as Kore.ai, Yellow.ai, MS Bot Framework and other similar tools.\n* Strong problem\\-solving and analytical skills.\n* Excellent communication and interpersonal skills.\n* Ability to work independently and manage multiple projects simultaneously.\n\n\n**Mandatory Skill Sets**\n Gen AI, Python, Node JS, Javascript\n   \n\n  \n\n**Preferred Skill Sets**\n Gen AI, Python, Node JS, Javascript\n   \n\n  \n\n**Years Of Experience Required**\n 4 \\- 7\n   \n\n  \n\n**Education Qualification**\n B.Tech \/ M.Tech \/ MBA \/ MCA\n   \n\n  \n\n**Education** \n*(if blank, degree and\/or field of study not specified)*\n Degrees\/Field of Study required: Master of Business Administration, Master of Engineering, Bachelor of Engineering\n   \n\n  \n\n**Degrees\/Field Of Study Preferred**\n**Certifications** \n*(if blank, certifications not specified)*\n**Required Skills**\n Conversational AI\n   \n\n  \n\n**Optional Skills**\n Accepting Feedback, Accepting Feedback, Active Listening, AI Implementation, Analytical Thinking, C\\+\\+ Programming Language, Communication, Complex Data Analysis, Creativity, Data Analysis, Data Infrastructure, Data Integration, Data Modeling, Data Pipeline, Data Quality, Deep Learning, Embracing Change, Emotional Regulation, Empathy, GPU Programming, Inclusion, Intellectual Curiosity, Java (Programming Language), Learning Agility, Machine Learning {\\+ 25 more}\n   \n\n  \n\n**Desired Languages** \n*(If blank, desired languages not specified)*\n**Travel Requirements**\n Not Specified\n   \n\n  \n\n**Available for Work Visa Sponsorship?**\n No\n   \n\n  \n\n**Government Clearance Required?**\n No\n   \n\n  \n\n**Job Posting End Date**",
        "company_industry":"Business Consulting and Services",
        "company_url":"https:\/\/in.linkedin.com\/company\/pwc-india",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQFYf1IhPukA5Q\/company-logo_100_100\/company-logo_100_100\/0\/1719912934875\/pwc_india_logo?e=2147483647&v=beta&t=C7FShWuDFc2twP4u8aW9jUbkShzPr_ceL6Mf_G5Dx7I",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4160853902",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4160853902",
        "job_url_direct":"https:\/\/jobs.telusdigital.com\/en_US\/careers\/PipelineDetail\/Machine-Learning-Software-Development-Engineer\/61746?source=LinkedIn&urlHash=eQHE",
        "title":"Machine Learning Software Development Engineer",
        "company":"TELUS Digital",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":null,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"entry level",
        "job_function":"Engineering and Information Technology",
        "listing_type":null,
        "emails":null,
        "description":"**Requirements**\n**Description and Requirements**\n* Language Model Development: Utilise off\\-the\\-shelf LLM services, such as Azure OpenAI, to integrate LLM capabilities into applications, and collaborate with various stakeholders to design and develop state\\-of\\-the\\-art language models.\n* Model Training and Evaluation: Train and fine\\-tune Large Language Models (LLMs) for specific NLP tasks using appropriate frameworks and tools. Possess strong logical thinking abilities to design and construct effective conversational flows, ensuring a seamless and intuitive user experience within the chatbot interactions.\n* Research and Innovation: Stay up to date with the latest advancements in the fields of NLP, LLM and ML. Proactively identify opportunities to leverage new technologies for improved solutions.\n\n\n**Additional Job Description**\n* Bachelor’s degree in Computer Science, Engineering, Applied Mathematics, or Linguistics.\n* 2\\+ years of experience in applying large language and generative AI models, including transformers and GPT models.\n* Strong programming skills in scripting languages such as Python, NodeJS, R, JavaScript.\n* Prior experience to apply Deep Learning, Natural Language Processing and LLM frameworks such LangChain, SpaCy, Facebook AI XLM\/mBERT, OpenAI, Hugging Face, Cohere, TensorFlow, PyTorch etc.\n* Knowledge\/experience in building Chatbots using bot platforms like Dialogflow,Microsoft Bot Framework, IBM Watson, Rasa etc.\n* Experience in working with cloud computing systems and services. For example,DocumentAI from GCP and IDP(Intelligent Document Processing) from AWS etc,.\n\n\n EEO Statement\n   \n\n  \n\n At TELUS Digital, we enable customer experience innovation through spirited teamwork, agile thinking, and a caring culture that puts customers first. TELUS International is the global arm of TELUS Corporation, one of the largest telecommunications service providers in Canada. We deliver contact center and business process outsourcing (BPO) solutions to some of the world's largest corporations in the consumer electronics, finance, telecommunications and utilities sectors. With global call center delivery capabilities, our multi\\-shore, multi\\-language programs offer safe, secure infrastructure, value\\-based pricing, skills\\-based resources and exceptional customer service \\- all backed by TELUS, our multi\\-billion dollar telecommunications parent.\n   \n\n  \n\n Equal Opportunity Employer\n   \n\n  \n\n At TELUS International, we are proud to be an equal opportunity employer and are committed to creating a diverse and inclusive workplace. All aspects of employment, including the decision to hire and promote, are based on applicants’ qualifications, merits, competence and performance without regard to any characteristic related to diversity.",
        "company_industry":"IT Services and IT Consulting",
        "company_url":"https:\/\/ca.linkedin.com\/company\/telus-digital",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQEo2Kofedd9rg\/company-logo_100_100\/company-logo_100_100\/0\/1719936181768\/telus_international_logo?e=2147483647&v=beta&t=98W-HKYhVpwYgiIBLnNuyEeYH8EtQVkHWQHgaJzs66Y",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4166749583",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4166749583",
        "job_url_direct":"https:\/\/www.expertia.ai\/finvatech\/job\/hiring-data-scientist-664d805e2a6955cba27ca07d?utm_source=linkedin-feed&easy_apply=true&date-refresh=02\/27\/2025&urlHash=9AVQ",
        "title":"Data Scientist",
        "company":"Finva Tech Pvt Ltd",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":null,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"associate",
        "job_function":"Information Technology",
        "listing_type":null,
        "emails":null,
        "description":"**Skills:**\n Statistical Data Analysis, Machine Learning, Python (Programming Language), Predictive Modeling, ChatGPT, Large Language Models (LLM),\n   \n\n  \n\n**Responsibilities**\n* Develop and fine\\-tune GPT\\-based chatbot models to ensure optimal performance.\n* Create and optimize prompts to generate relevant and coherent responses from the chatbot.\n* Collaborate with cross\\-functional teams to integrate chatbot solutions into various applications.\n* Stay updated with the latest advancements in NLP and machine learning to apply best practices.\n* Troubleshoot and address issues related to the chatbot's performance and functionality.\n\n\n**Requirements**\n* Bachelor's or Master's degree in Computer Science, Machine Learning, or a related field.\n* Minimum of 5 years of hands\\-on experience in Python programming.\n* Strong expertise in natural language processing and machine learning, especially with GPT\\-based models.\n* Proven track record of developing and deploying chatbots or conversational AI systems.\n* Proficiency in understanding user intent and crafting effective prompts to elicit desired responses.\n* Familiarity with relevant libraries and frameworks (e.g., Transformers, PyTorch, TensorFlow).\n* Excellent problem\\-solving skills and the ability to work independently or in a team.\n* Strong communication skills to collaborate with non\\-technical stakeholders.\n* Experience with cloud platforms and deployment of chatbot solutions is a plus.\n* Act as full stack data scientist to develop mathematical, analytical, optimization and\/or AI\/ML models to support evidence\\-based decision making. Ensure overall quality of the data solutions throughout the analytic development process and support deploying them as end\\-to\\-end products on Google Cloud Platform",
        "company_industry":"IT Services and IT Consulting",
        "company_url":"https:\/\/in.linkedin.com\/company\/finva-tech",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQFx0mzJF7F_6g\/company-logo_100_100\/company-logo_100_100\/0\/1698060103504\/finva_tech_logo?e=2147483647&v=beta&t=_YOUMjQx5Sn--PwFJzzmOmdUYDE5eQs47MwBjsv3TOw",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4143170526",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4143170526",
        "job_url_direct":"https:\/\/pwc.wd3.myworkdayjobs.com\/Global_Experienced_Careers\/job\/Bengaluru-Millenia\/IN-Senior-Associate-AI-Engineer-Data\\u002d\\u002d-Analytics-Advisory-PAN-India_602497WD-1\/?source=LinkedIn&urlHash=GTYp",
        "title":"IN-Senior Associate_AI Engineer_Data & Analytics_Advisory_PAN India",
        "company":"PwC India",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":null,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"mid-senior level",
        "job_function":"Engineering and Information Technology",
        "listing_type":null,
        "emails":null,
        "description":"**Line of Service**\n Advisory\n   \n\n  \n\n**Industry\/Sector**\n Not Applicable\n   \n\n  \n\n**Specialism**\n Data, Analytics \\& AI\n   \n\n  \n\n**Management Level**\n Senior Associate\n   \n\n  \n\n**Job Description \\& Summary**\n At PwC, our people in data and analytics focus on leveraging data to drive insights and make informed business decisions. They utilise advanced analytics techniques to help clients optimise their operations and achieve their strategic goals.\n   \n\n  \n\n In business intelligence at PwC, you will focus on leveraging data and analytics to provide strategic insights and drive informed decision\\-making for clients. You will develop and implement innovative solutions to optimise business performance and enhance competitive advantage.\n   \n\n  \n\n* Why PWC\n\n\n At PwC, you will be part of a vibrant community of solvers that leads with trust and creates distinctive outcomes for our clients and communities. This purpose\\-led and values\\-driven work, powered by technology in an environment that drives innovation, will enable you to make a tangible impact in the real world. We reward your contributions, support your wellbeing, and offer inclusive benefits, flexibility programmes and mentorship that will help you thrive in work and life. Together, we grow, learn, care, collaborate, and create a future of infinite experiences for each other. Learn more about us.\n   \n\n  \n\n At PwC, we believe in providing equal employment opportunities, without any discrimination on the grounds of gender, ethnic background, age, disability, marital status, sexual orientation, pregnancy, gender identity or expression, religion or other beliefs, perceived differences and status protected by law. We strive to create an environment where each one of our people can bring their true selves and contribute to their personal growth and the firm’s growth. To enable this, we have zero tolerance for any discrimination and harassment based on the above considerations. \"\n   \n\n  \n\n**Responsibilities**\n Main responsibilities will include:\n   \n\n  \n\n* Develop and implement conversational AI solutions that meet client needs.\n* Build and train natural language processing models to improve accuracy and understanding.\n* Design and develop conversational interfaces that are intuitive and easy for users to navigate.\n* Work with cross\\-functional teams to integrate conversational AI solutions into existing systems.\n* Troubleshoot and resolve technical issues related to conversational AI solutions.\n* Stay up\\-to\\-date with the latest developments in conversational AI and identify new opportunities for growth and innovation.\n\n\n**Mandatory Skill Sets**\n AI Engineer, NLP\n   \n\n  \n\n**Preferred Skill Sets**\n AI Engineer, NLP\n   \n\n  \n\n**Years Of Experience Required**\n 4\\-10 Years\n   \n\n  \n\n**Education Qualification**\n BE, B.Tech, MCA, M.Tech\n   \n\n  \n\n**Education** \n*(if blank, degree and\/or field of study not specified)*\n Degrees\/Field of Study required: Master of Engineering, Bachelor of Engineering\n   \n\n  \n\n**Degrees\/Field Of Study Preferred**\n**Certifications** \n*(if blank, certifications not specified)*\n**Required Skills**\n Natural Language Processing (NLP)\n   \n\n  \n\n**Optional Skills**\n Accepting Feedback, Accepting Feedback, Active Listening, Analytical Thinking, Business Case Development, Business Data Analytics, Business Intelligence and Reporting Tools (BIRT), Business Intelligence Development Studio, Communication, Competitive Advantage, Continuous Process Improvement, Creativity, Data Analysis and Interpretation, Data Architecture, Database Management System (DBMS), Data Collection, Data Pipeline, Data Quality, Data Science, Data Visualization, Embracing Change, Emotional Regulation, Empathy, Inclusion, Industry Trend Analysis {\\+ 12 more}\n   \n\n  \n\n**Desired Languages** \n*(If blank, desired languages not specified)*\n**Travel Requirements**\n**Available for Work Visa Sponsorship?**\n**Government Clearance Required?**\n**Job Posting End Date**",
        "company_industry":"Business Consulting and Services",
        "company_url":"https:\/\/in.linkedin.com\/company\/pwc-india",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQFYf1IhPukA5Q\/company-logo_100_100\/company-logo_100_100\/0\/1719912934875\/pwc_india_logo?e=2147483647&v=beta&t=C7FShWuDFc2twP4u8aW9jUbkShzPr_ceL6Mf_G5Dx7I",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4143171474",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4143171474",
        "job_url_direct":"https:\/\/pwc.wd3.myworkdayjobs.com\/Global_Experienced_Careers\/job\/Bengaluru-Millenia\/IN-Senior-Associate-AI-Engineer-Data\\u002d\\u002d-Analytics-Advisory-PAN-India_602480WD\/?source=LinkedIn&urlHash=axsF",
        "title":"IN-Senior Associate_AI Engineer_Data & Analytics_Advisory_PAN India",
        "company":"PwC India",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":null,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"mid-senior level",
        "job_function":"Engineering and Information Technology",
        "listing_type":null,
        "emails":null,
        "description":"**Line of Service**\n Advisory\n   \n\n  \n\n**Industry\/Sector**\n Not Applicable\n   \n\n  \n\n**Specialism**\n Data, Analytics \\& AI\n   \n\n  \n\n**Management Level**\n Senior Associate\n   \n\n  \n\n**Job Description \\& Summary**\n At PwC, our people in data and analytics focus on leveraging data to drive insights and make informed business decisions. They utilise advanced analytics techniques to help clients optimise their operations and achieve their strategic goals.\n   \n\n  \n\n In business intelligence at PwC, you will focus on leveraging data and analytics to provide strategic insights and drive informed decision\\-making for clients. You will develop and implement innovative solutions to optimise business performance and enhance competitive advantage.\n   \n\n  \n\n* Why PWC\n\n\n At PwC, you will be part of a vibrant community of solvers that leads with trust and creates distinctive outcomes for our clients and communities. This purpose\\-led and values\\-driven work, powered by technology in an environment that drives innovation, will enable you to make a tangible impact in the real world. We reward your contributions, support your wellbeing, and offer inclusive benefits, flexibility programmes and mentorship that will help you thrive in work and life. Together, we grow, learn, care, collaborate, and create a future of infinite experiences for each other. Learn more about us.\n   \n\n  \n\n At PwC, we believe in providing equal employment opportunities, without any discrimination on the grounds of gender, ethnic background, age, disability, marital status, sexual orientation, pregnancy, gender identity or expression, religion or other beliefs, perceived differences and status protected by law. We strive to create an environment where each one of our people can bring their true selves and contribute to their personal growth and the firm’s growth. To enable this, we have zero tolerance for any discrimination and harassment based on the above considerations. \"\n   \n\n  \n\n**Responsibilities**\n Main responsibilities will include:\n   \n\n  \n\n* Develop and implement conversational AI solutions that meet client needs.\n* Build and train natural language processing models to improve accuracy and understanding.\n* Design and develop conversational interfaces that are intuitive and easy for users to navigate.\n* Work with cross\\-functional teams to integrate conversational AI solutions into existing systems.\n* Troubleshoot and resolve technical issues related to conversational AI solutions.\n* Stay up\\-to\\-date with the latest developments in conversational AI and identify new opportunities for growth and innovation.\n\n\n**Mandatory Skill Sets**\n AI Engineer, NLP\n   \n\n  \n\n**Preferred Skill Sets**\n AI Engineer, NLP\n   \n\n  \n\n**Years Of Experience Required**\n 4\\-10 Years\n   \n\n  \n\n**Education Qualification**\n BE, B.Tech, MCA, M.Tech\n   \n\n  \n\n**Education** \n*(if blank, degree and\/or field of study not specified)*\n Degrees\/Field of Study required: Bachelor of Engineering, Master of Engineering\n   \n\n  \n\n**Degrees\/Field Of Study Preferred**\n**Certifications** \n*(if blank, certifications not specified)*\n**Required Skills**\n Natural Language Processing (NLP)\n   \n\n  \n\n**Optional Skills**\n Accepting Feedback, Accepting Feedback, Active Listening, Analytical Thinking, Business Case Development, Business Data Analytics, Business Intelligence and Reporting Tools (BIRT), Business Intelligence Development Studio, Communication, Competitive Advantage, Continuous Process Improvement, Creativity, Data Analysis and Interpretation, Data Architecture, Database Management System (DBMS), Data Collection, Data Pipeline, Data Quality, Data Science, Data Visualization, Embracing Change, Emotional Regulation, Empathy, Inclusion, Industry Trend Analysis {\\+ 12 more}\n   \n\n  \n\n**Desired Languages** \n*(If blank, desired languages not specified)*\n**Travel Requirements**\n**Available for Work Visa Sponsorship?**\n**Government Clearance Required?**\n**Job Posting End Date**",
        "company_industry":"Business Consulting and Services",
        "company_url":"https:\/\/in.linkedin.com\/company\/pwc-india",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQFYf1IhPukA5Q\/company-logo_100_100\/company-logo_100_100\/0\/1719912934875\/pwc_india_logo?e=2147483647&v=beta&t=C7FShWuDFc2twP4u8aW9jUbkShzPr_ceL6Mf_G5Dx7I",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    }
]