[
    {
        "id":"gd-1009655854510",
        "site":"glassdoor",
        "job_url":"https:\/\/www.glassdoor.com\/job-listing\/j?jl=1009655854510",
        "job_url_direct":null,
        "title":"Senior AI Engineer",
        "company":"Emmes Global",
        "location":"Bengaluru",
        "date_posted":1740787200000,
        "job_type":null,
        "salary_source":"direct_data",
        "interval":"yearly",
        "min_amount":360000.0,
        "max_amount":763000.0,
        "currency":"INR",
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":"organic",
        "emails":null,
        "description":"Overview:\n\nEmmes Group: Building a better future for us all.  \n\nEmmes Group is transforming the future of clinical research, bringing the promise of new medical discovery closer within reach for patients. Emmes Group was founded as Emmes more than 47 years ago, becoming one of the primary clinical research providers to the US government before expanding into public\\-private partnerships and commercial biopharma. Emmes has built industry leading capabilities in cell and gene therapy, vaccines and infectious diseases, ophthalmology, rare diseases, and neuroscience.  \n\nWe believe the work we do will have a direct impact on patients’ lives and act accordingly. We strive to build a collaborative culture at the intersection of being a performance and people driven company. We’re looking for talented professionals eager to help advance clinical research as we work to embed innovation into the fabric of our company. If you share our motivations and passion in research, come join us! **Primary Purpose**  \n\nWe are looking for a Senior AI Engineer with expertise in AWS\\-based AI\/ML solutions to join our team. In this role, you will be responsible for automating the AI lifecycle, from data preparation, model training, and deployment to monitoring and integration within a fully AWS\\-driven environment. You will work closely with data engineers, data scientists, software engineers, and product managers to develop and deploy scalable Generative AI and NLP solutions using AWS services.\n\n\nResponsibilities:\n* Develop and deploy machine learning models using Generative AI, NLP, and Large Language Models (LLMs) in an AWS ecosystem.\n* Utilize AI framework (Lang Chain, Llama Index etc), Bedrock, and SageMaker to develop and integrate AI\\-driven agents and language models.\n* Automate and optimize end\\-to\\-end AI workflows, including data processing, model training, deployment, inference and monitoring using AWS Lambda, EC2, S3, SageMaker, and Bedrock.\n* Architect and implement scalable and cost\\-effective AI solutions using AWS infrastructure best practices.\n* Optimize AI workloads for high performance and cost\\-efficiency in AWS environments.\n* Monitor model performance, retrain, and optimize ML pipelines for scalability and efficiency.\n* Work closely with data engineers and software developers to integrate AI models into AWS\\-native applications.\n* Document technical implementations and communicate best practices across teams.\n* Stay up to date with AWS AI\/ML advancements and emerging AI trends to enhance system performance and capabilities.\n\n\nQualifications:\n* Engineering\/master’s degree in computer science, Data Science, AI, or a related field.\n* 4\\+ years of experience in Machine Learning, AI engineering, and model deployment in AWS environments.\n* Strong expertise in AWS AI\/ML services, including SageMaker, Bedrock, Lambda, S3, and EC2\\.\n* Experience in Generative AI, NLP, Computer Vision and LLM\\-based solutions using Python and associated libraries.\n* Hands\\-on experience in fine\\-tuning pre\\-trained CNN\/LLM models and building them from scratch.\n* Experience with MLOps, CI\/CD pipelines, and model monitoring in AWS.\n* Proficiency in ML frameworks like TensorFlow, PyTorch, Keras, and scikit\\-learn.\n* Solid understanding of cloud\\-native AI architectures, infrastructure optimization, and security best practices.\n* Strong problem\\-solving and analytical skills with the ability to work in a cross\\-functional team.\n* Excellent communication skills for technical and non\\-technical stakeholders.\n* Engineering\/master’s degree in computer science, Data Science, AI, or a related field.\n* 3\\+ years of experience in Machine Learning, AI engineering, and model deployment in AWS environments.\n* Strong expertise in AWS AI\/ML services, including SageMaker, Bedrock, Lambda, S3, and EC2\\.\n* Experience in Generative AI, NLP, Computer Vision and LLM\\-based solutions using Python and associated libraries.\n* Hands\\-on experience in fine\\-tuning pre\\-trained CNN\/LLM models and building them from scratch.\n* Experience with MLOps, CI\/CD pipelines, and model monitoring in AWS.\n* Proficiency in ML frameworks like TensorFlow, PyTorch, Keras, and scikit\\-learn.\n* Solid understanding of cloud\\-native AI architectures, infrastructure optimization, and security best practices.\n* Strong problem\\-solving and analytical skills with the ability to work in a cross\\-functional team.\n* Excellent communication skills for technical and non\\-technical stakeholders.\n\n**CONNECT WITH US!***Follow us on Twitter \\- @EmmesCRO**Find us on LinkedIn \\- Emmes*",
        "company_industry":null,
        "company_url":"https:\/\/www.glassdoor.com\/Overview\/W-EI_IE106987.htm",
        "company_logo":"https:\/\/media.glassdoor.com\/sql\/106987\/the-emmes-company-squareLogo-1710868865951.png",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"gd-1009656842510",
        "site":"glassdoor",
        "job_url":"https:\/\/www.glassdoor.com\/job-listing\/j?jl=1009656842510",
        "job_url_direct":null,
        "title":"Lead Software Engineer - Data Engineer, AWS,Databricks",
        "company":"JPMorganChase",
        "location":"Bengaluru",
        "date_posted":1740787200000,
        "job_type":null,
        "salary_source":"direct_data",
        "interval":"yearly",
        "min_amount":290000.0,
        "max_amount":1000000.0,
        "currency":"INR",
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":"organic",
        "emails":null,
        "description":"**JOB DESCRIPTION**  \n\nWe have an exciting and rewarding opportunity for you to take your software engineering career to the next level\n\n\nAs a Lead Software Engineer at JPMorgan Chase within the Commercial \\& Investment Banking's Global Bank Technology Team, you'll serve as a seasoned member of an agile team to design and deliver trusted market\\-leading Data Engineering Solutions and Data products in a secure, stable, and scalable way. You are responsible for carrying out critical technology solutions across multiple technical areas within various business functions in support of the firm’s business objectives.\n\n**Job Responsibilities:**\n\n* Design and implement scalable data architectures using Databricks at an enterprise\\-scale.\n* Design and implement Databricks integration and interoperability with other cloud providers such as AWS, Snowflake, Immuta, and OpenAI.\n* Collaborate with data scientists, analysts and business stakeholders to understand requirements and deliver solutions.\n* Develop and maintain data architecture standards, including data product interfaces, data contracts, and governance frameworks.\n* Implement data governance and security measures to ensure data quality and compliance with industry and regulatory standards.\n* Monitor and optimize the performance and scalability of data products and infrastructure.\n* Provide training and support to domain teams on data mesh principles and cloud data technologies.\n* Stay up\\-to\\-date with industry trends and emerging technologies in data mesh and cloud computing.\n\n**Required qualifications, capabilities, and skills:**\n\n* Formal training or certification on software engineering concepts and 5\\+ years applied experience\n* 12\\+ years applied experience in Data Engineering space using enterprise tools, home grown frameworks and 5\\+ years of speciality in Databricks implementation from start to end.\n* 5\\+ years of experience in AWS cloud environment \\& Databricks.\n* Experience as a Databricks solution architect or tech lead or similar role in an enterprise environment.\n* Hands\\-on practical experience delivering system design, application development, testing, and operational stability\n* Influencer with a proven record of successfully driving change and transforming across organizational boundaries\n* Ability to present and effectively communicate to Senior Leaders and Executives.\n* Experience in Python, Spark \\& Streaming (Spark Streaming or KAFKA or Kinesis) is a must\n\nDeep understanding of Apache Spark, Delta Lake, DLT and other big data technologies  \n* \n\n**Preferred qualifications, capabilities, and skills:**\n\n* Databricks and AWS certification\n* Experience of working in a development teams, using agile techniques and Object Oriented development and scripting languages, is preferred.\n* Experience with LLM \\& AI\/ML is preferred.\n\n\n**ABOUT US**",
        "company_industry":null,
        "company_url":"https:\/\/www.glassdoor.com\/Overview\/W-EI_IE5224839.htm",
        "company_logo":"https:\/\/media.glassdoor.com\/sql\/5224839\/jpmorgan-chase-and-co-squareLogo-1724869012253.png",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"gd-1009654358349",
        "site":"glassdoor",
        "job_url":"https:\/\/www.glassdoor.com\/job-listing\/j?jl=1009654358349",
        "job_url_direct":null,
        "title":"Quantitative Research Associate - Asset and Wealth Management Risk",
        "company":"JPMorganChase",
        "location":"Bengaluru",
        "date_posted":1740700800000,
        "job_type":null,
        "salary_source":"direct_data",
        "interval":"yearly",
        "min_amount":518500.0,
        "max_amount":638500.0,
        "currency":"INR",
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":"organic",
        "emails":null,
        "description":"**JOB DESCRIPTION**  \n\nAre you looking for an exciting opportunity to join a dynamic and growing team in a fast paced and challenging area? This is a unique opportunity for you to work in our team to partner with the Business to provide a comprehensive view.\n\n\nAs a **Quantitative Research Associate** **\\-** **Asset and Wealth Management Risk** in the Asset \\& Wealth Management Risk Team, you will be a key member of a diverse and innovative group of quantitative and market risk professionals. Your role will involve developing and maintaining risk measurement methodologies, performing analytics calculations, and managing the Asset and Wealth Management Risk System (Newton). This system, which is continuously developed and maintained by our team, is used by both Risk and Front Office stakeholders within the Asset and Wealth Management sector. We are looking for an analyst to join and partner with senior members of our team to embark on a journey of innovation to introduce and scale up data\\-driven risk analytics solutions through data science and machine learning techniques to transform our operations and business processes, strengthening the core value proposition of our system and expanding flexible analytical capabilities for the growth of Newton’s platform.\n\n\n**Job responsibilities :**\n\n* Contribute to the research and enhancement of the risk methodology for AWM Risk Analytics. The methodology covers sensitivity, stress, VaR, factor modeling, and Lending Value pricing for investment (market), counterparty (credit), and liquidity risk.\n* Work with peers and stakeholders to identify use cases and opportunities for Data Science to create value. Use your knowledge of Computer Science, Statistics, Mathematics and Data Science techniques to provide further insights into security and portfolio risk analytics.\n* Assist with continuous improvements in our adopted Machine Learning and statistical technics used in our data and analytics validation process.\n* Collaborate, design, and deliver solutions that are flexible and scalable using the firm’s approved tools.\n* Prepare comprehensive model documentation for the Model Risk Governance and Review group to validate the models our team owns and uses, along with ongoing monitoring and back testing.\n* Contribute to the analysis of new and large data sets and assist with their onboarding, following our best practice data model and architecture using big data platforms.\n\n\n\n\n**Required qualifications, capabilities, and skills :**\n\n* 2\\+ years of experience in a quantitative analysis\/research role\/ data scientist role within Market\/Credit Risk Management, a Front Office role or academic equivalent\n* A quantitative, technically proficient individual who is detail\\-oriented, able to multi\\-task, and work independently.\n* Excellent communication skills.\n* A strong understanding of statistics, applied AI\/ML techniques, and a practical problem\\-solving mindset. Practical experience in financial markets in a quantitative analysis\/research role within Risk Management, a Front Office role\n\n\n\n\n**Preferred qualifications, capabilities, and skills :**\n\n* Knowledge of asset pricing, VaR backtesting techniques, and model performance testing is a plus.\n* Knowledge in modular programming in SQL, Python, ML, AWS Sagemaker and TensorFlow is preferred.\n* A degree in a quantitative or technology field (Economics, Maths\/Statistics, Engineering, Computer Science or equivalent) is preferred.\n\n\n\n\n**ABOUT US**  \n\nJPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.  \n\n  \n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\n  \n\n  \n\n  \n\n**ABOUT THE TEAM**  \n\n  \n\nJ.P. Morgan Asset \\& Wealth Management delivers industry\\-leading investment management and private banking solutions. Asset Management provides individuals, advisors and institutions with strategies and expertise that span the full spectrum of asset classes through our global network of investment professionals. Wealth Management helps individuals, families and foundations take a more intentional approach to their wealth or finances to better define, focus and realize their goals.",
        "company_industry":null,
        "company_url":"https:\/\/www.glassdoor.com\/Overview\/W-EI_IE5224839.htm",
        "company_logo":"https:\/\/media.glassdoor.com\/sql\/5224839\/jpmorgan-chase-and-co-squareLogo-1724869012253.png",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"gd-1009654300716",
        "site":"glassdoor",
        "job_url":"https:\/\/www.glassdoor.com\/job-listing\/j?jl=1009654300716",
        "job_url_direct":null,
        "title":"Data Engineering Manager",
        "company":"HireRight",
        "location":"Bengaluru",
        "date_posted":1740700800000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":"organic",
        "emails":null,
        "description":"About HireRight:\n\nHireRight is the premier global background screening and workforce solutions provider. We bring clarity and confidence to vetting and hiring decisions through integrated, tailored solutions, driving a higher standard of accuracy in everything we do. Combining in\\-house talent, personalized services, and proprietary technology, we ensure the best candidate experience possible. PBSA accredited and based in Nashville, TN, we offer expertise from our regional centers across 200 countries and territories in The Americas, Europe, Asia, and the Middle East. Our commitment to get it right every time, everywhere, makes us the trusted partner of businesses and organizations worldwide.\nOverview:\n* Design, build, test and deploy new data pipelines within On Prem or Cloud Data Eco\\-Systems\n* Coordinates oversight into existing data pipelines, including the implementation of solutions that will simplify and increase performance.\n* Ensures team follows best practices and execute architected techniques and solutions for data collection, management and usage to aid in company\\-wide data governance and management framework.\n* Work closely with the data analysts and scientists, and database and systems administrators to create data solutions.\n* Evaluate new data sources for quality and attribution to support product requirements.\n* Documents new\/existing pipelines, Data Sets and Data Sets lineage.\n* The work activity includes processing complex data sets, leveraging technologies used to process these disparate data sets and understanding the correlations as well as patterns that exist between these different complex data sets.\n* Sets team priorities to ensure task completion.\n* Participate in the formulation of departmental objectives, plans and policies.\n* Sets goals, provides feedback to team members, and conducts regular performance evaluations.\n* Interprets customer needs and assesses requirements; works with team members to aid in understanding tasks to support the production of solutions.\n* Engages in recruiting and training of new staff.\n* Provides concise status updates and challenges to senior management.\n\n\nResponsibilities:\n* Strong communication skills, with the ability to present complex technical solutions in a manner that can be interpreted by a general audience. This includes proficiency in Powerpoint, Visio, Drawio, etc.\n* Familiar with software development life cycle as it relates to data integration and data quality.\n* Experience in designing and building production data pipelines from ingestion to consumption within a hybrid data architecture, using Java, Python, Scala, C\\#, etc.\n* Experience in Designing and implementing scalable and secure data processing pipelines using Azure Data Factory, Azure Databricks, and other Azure services.\n* Experience in Managing and optimizing data storage using Azure Data Lake Storage, Azure SQL Data Warehouse, and Azure Cosmos DB.\n* Strong experience in common data warehouse modelling principles including Kimball, Inmon.\n* Strong experience with data processing frameworks such as Apache Spark and Hadoop\n* Ensuring data quality and consistency through data cleaning, transformation, and integration processes.\n* Knowledge of Dev\\-Ops processes (including CI\/CD) and Infrastructure as code is essential.\n* Experience in Managing Monitoring and troubleshooting data\\-related issues within the Azure environment to maintain high availability and performance.\n* Collaborating with data scientists, business analysts, and other stakeholders to understand data requirements and implement appropriate data solutions.\n* Implementing data security measures, including encryption, access controls, and auditing, to protect sensitive information.\n* Automating data pipelines and workflows to streamline data ingestion, processing, and distribution tasks.\n* Utilizing Azure's analytics services, such as Azure Synapse Analytics, to provide insights and support data\\-driven decision\\-making.\n* Knowledge of Microsoft BI Stack (SSRS\/SSAS (Tabular with DAX \\& OLAP with MDX) SSIS) is desirable.\n* Keeping abreast of the latest Azure features and technologies to enhance data engineering processes and capabilities.\n* Documenting data procedures, systems, and architectures to maintain clarity and ensure compliance with regulatory standards.\n* Providing guidance and support for data governance, including metadata management, data lineage, and data cataloging.\n* Skills in navigating interpersonal dynamics, resolving team conflicts while maintaining a positive work culture.\n\n\nQualifications:\n* BA\/BS in Computer Science, engineering or related field, or equivalent experience.\n* 5\\+ years of experiencing in a leadership role, managing and mentoring teams.\n* 5\\+ years of experience in area of data management and\/or data curation.\n* 5\\+ years development experience with Oracle and\/or SQL Server.\n* 5\\+ years of Experience with Python\/Pyspark frameworks\/libraries.\n* Expert level understanding on Azure Data Factory, Azure Synapse, Azure SQL, Azure Data Lake, and Azure App Service is required.\n* Ability to develop, implement and optimize code using procedural languages such as PL\/SQL, T\\-SQL, etc..\n* Experienced with SSIS and C\\# development\n* Experienced with data normalization and denormalization techniques\n* Experienced in implementing largescale event based streaming architectures\n* Experienced data transformation and data processing techniques\n* Knowledge of API and Microservice development\n* Experienced in Agile methodology and\/or pair programming\n* Preferred knowledge of AI\/ML concepts and technologies\n* Preferred experience with Stream\\-processing systems\n* Preferred working knowledge of cloud architectures on Azure or GCP\n* Strong communication skills\n* Strong writing and documentation skills\n* Experienced in working with cross functional teams, building alignment and collaboration\n* Preferred certification Azure Data Engineering Associate (DP203\\) and Implementing Analytic Solutions Using Microsoft Fabric (DP600\\).\n\n\nWhat do we offer:\n**In exchange for your expertise, HireRight offers an excellent employee benefit package which includes:**\n\n  \n\n* Medical\n* Dental\n* Vision\n* Paid Life\/AD\\&D Insurance\n* Voluntary Life Insurance\n* Short\\- \\& Long\\-Term Disability\n* Flexible Spending Accounts\n* 401K\n* Generous Vacation and Sick Program\n* 10 Paid Holidays\n* Education Assistance Program\n* Business Casual Attire\n* Generous Referral Program\n* Employee Discounts and Rewards\n* And much more!\n\n* *All resumes are held in confidence. Only candidates whose profiles closely match requirements will be contacted during this search.*\n\n **HireRight, LLC is an Equal Opportunity Employer**\n\n**Minorities \/ Females \/ Veterans \/ Disabilities**",
        "company_industry":null,
        "company_url":"https:\/\/www.glassdoor.com\/Overview\/W-EI_IE22707.htm",
        "company_logo":"https:\/\/media.glassdoor.com\/sql\/22707\/hireright-squarelogo-1582861990078.png",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"gd-1009654883179",
        "site":"glassdoor",
        "job_url":"https:\/\/www.glassdoor.com\/job-listing\/j?jl=1009654883179",
        "job_url_direct":null,
        "title":"Linux Admin ||4-6 Years || Bangalore",
        "company":"Capgemini Engineering",
        "location":"Bengaluru",
        "date_posted":1740700800000,
        "job_type":null,
        "salary_source":"direct_data",
        "interval":"yearly",
        "min_amount":300000.0,
        "max_amount":475000.0,
        "currency":"INR",
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":"organic",
        "emails":null,
        "description":"At Capgemini Engineering, the world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life\\-saving robots, our digital and software technology experts think outside the box as they provide unique R\\&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\n\n**Job Description**\n-------------------\n\nProvide support for Unix\/Linux systems, including installation, configuration, and maintenance.\n\n\nProvide L3 support to resolve complex technical issues related to Linux systems and applications.\n\n\nCollaborate with other teams to diagnose and troubleshoot cross\\-functional issues, ensuring timely resolution.\n\n\nMaintenance of multiple Linux systems, including patching \\& upgradation\n\n\nDevelop and maintain backup and recovery strategies for Linux systems, ensuring data integrity and availability.\n\n\nPerform regular backups and test recovery procedures to minimize downtime in case of system failures or disasters\n\n\nConduct regular security audits and vulnerability assessments, and apply necessary patches and updates.\n\n\nConfigure and manage firewalls, intrusion detection\/prevention systems, and other security tools.\n\n\nDeep understanding of OS and its management including kernel level troubleshooting\n\n\nExperience with Linux servers in virtualized environments.\n\n\nFamiliarity with the fundamentals of Linux scripting languages.\n\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55\\-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end\\-to\\-end services and solutions leveraging strengths from strategy and design to engineering, all fuelled by its market leading capabilities in AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2023 global revenues of €22\\.5 billion.",
        "company_industry":null,
        "company_url":"https:\/\/www.glassdoor.com\/Overview\/W-EI_IE28187.htm",
        "company_logo":"https:\/\/media.glassdoor.com\/sql\/28187\/capgemini-engineering-squareLogo-1683293407841.png",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-Nph_eDoTUJ3yjExJAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.linkedin.com\/jobs\/view\/assistant-professor-cse-it-ai-ds-cyber-sec-at-easa-college-of-engineering-technology-4166744809?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Assistant Professor - CSE, IT, AI&DS, Cyber Sec",
        "company":"Easa College of Engineering & Technology",
        "location":"Coimbatore, Tamil Nadu",
        "date_posted":1740528000000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Skills:\nME, Computer Science, Cyber Security, Artificial Intelligence (AI), Data Science, Python (Programming Language), C++, Java,\n\nCompany Overview\n\nEasa College of Engineering & Technology is a higher education company located in Coimbatore, Tamil Nadu, India. It is dedicated to providing quality education in the field of engineering and technology.\n\nJob Overview\n\nAssistant Professor role at Easa College Of Engineering & Technology in Coimbatore, Tamil Nadu, India. Full-Time position for Fresher with less than 1 year of experience. Salary range: Competitive. Employee count: 201-500.\n\nQualifications And Skills\n• Master's in Engineering (ME) with a focus on Computer Science.\n• Strong knowledge in Cyber Security, Artificial Intelligence (AI), and Data Science.\n• Passion for teaching and mentoring students in higher education settings.\n• Excellent communication and presentation skills.\n• Ability to work collaboratively in a diverse academic environment.\n\nRoles And Responsibilities\n• Deliver lectures, conduct tutorials, and evaluate students in Computer Science, IT, AI&DS, and Cyber Security courses.\n• Develop course materials, assessments, and projects in alignment with the curriculum.\n• Mentor and guide students in their academic and research endeavors.\n• Contribute to research projects and publications in relevant fields.\n• Participate in faculty meetings, committees, and academic programs.",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-luGKm7Fv2jtLu8_JAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.linkedin.com\/jobs\/view\/teaching-assistant-cse-it-cyber-ai-ds-at-easa-college-of-engineering-technology-4166753270?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Teaching Assistant - CSE \/ IT \/ Cyber \/ AI & DS",
        "company":"Easa College of Engineering & Technology",
        "location":"Coimbatore, Tamil Nadu",
        "date_posted":1740528000000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Skills:\nPython (Programming Language), Cybersecurity, C (Programming Language), Artificial Intelligence (AI), Data Science, Machine Learning, Cloud Computing, Data Structures,\n\nCompany Overview\n\nEasa College of Engineering & Technology is a higher education company based out of NH-47, PALAKKAD MAIN ROAD NAVAKKARAI (PO), COIMBATORE, Tamil Nadu, India. Easa College Of Engineering & Technology has 201-500 employees employees. Its website is http:\/\/www.easacollege.com. It has its headquarters in COIMBATORE, Tamil Nadu. It belongs to the Higher Education sector.\n\nJob Overview\n\nTeaching Assistant - B.E \/ B.Tech in CSE\/IT (Fresher) - Full-Time in Coimbatore\n\nQualifications And Skills\n• B.E\/B.Tech in Computer Science Engineering (CSE) or Information Technology (IT)\n• Knowledge of Python (Programming Language)\n• Understanding of Cybersecurity\n• Proficiency in C (Programming Language)\n• Familiarity with Artificial Intelligence (AI), Data Science, and Machine Learning\n• Experience or knowledge in Cloud Computing and Data Structures\n\nRoles And Responsibilities\n• Assist in conducting classes and tutorials for students\n• Provide support to professors in lesson preparation and grading\n• Help students with queries and provide additional explanations when needed\n• Participate in the development and implementation of educational programs and materials\n• Support students in lab practical sessions related to programming, cybersecurity, AI, and data science projects",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-WrMy7djJS6w7N2bIAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.linkedin.com\/jobs\/view\/data-scientist-ii-alexa-sensitive-content-intelligence-at-amazonodotcom-4164137268?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Data Scientist - II, Alexa Sensitive Content Intelligence",
        "company":"AmazonOdotcom",
        "location":"Bengaluru, Karnataka",
        "date_posted":1740441600000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Alexa is the voice activated digital assistant powering devices like Amazon Echo, Echo Dot, Echo Show, and Fire TV, which are at the forefront of this latest technology wave. To preserve our customers experience and trust, the Alexa Sensitive Content Intelligence (ASCI) team builds services and tools through Machine Learning techniques to implement our policies to detect and mitigate sensitive content in across Alexa.\n\nWe are looking for a passionate, talented, and inventive Data Scientist-II to help build industry-leading technology with Large Language Models (LLMs) and multimodal systems, requiring good learning and generative models knowledge. You will be working with a team of exceptional Data Scientists working in a hybrid, fast-paced organization where scientists, engineers, and product managers work together to build customer-facing experiences. You will collaborate with other data scientists while understanding the role data plays in developing data sets and exemplars that meet customer needs. You will analyze and automate processes for collecting and annotating LLM inputs and outputs to assess data quality and measurement.\n\nYou will apply state-of-the-art Generative AI techniques to analyze how well our data represents human language and run experiments to gauge downstream interactions. You will work collaboratively with other data scientists and applied scientists to design and implement principled strategies for data optimization.\n\nKey Job Responsibilities\n\nA Data Scientist-II should have a reasonably good understanding of NLP models (e.g. LSTM, LLMs, other transformer-based models) or CV models (e.g. CNN, AlexNet, ResNet, GANs, ViT) and know of ways to improve their performance using data. You leverage your technical expertise in improving and extending existing models. Your work will directly impact our customers in the form of products and services that make use of speech, language, and computer vision technologies.\n\nYou will be joining a select group of people making history producing one of the most highly rated products in Amazon's history, so if you are looking for a challenging and innovative role where you can solve important problems while growing in your career, this may be the place for you.\n\nA day in the life\n\nYou will be working with a group of talented scientists on running experiments to test scientific proposal\/solutions to improve our sensitive content detection and mitigation for worldwide coverage. This will involve collaboration with partner teams including engineering, PMs, data annotators, and other scientists to discuss data quality, policy, model development, and solution implementation. You will work with other scientists, collaborating and contributing to extending and improving solutions for the team.\n\nAbout The Team\n\nThe mission of the Alexa Sensitive Content Intelligence (ASCI) team is to (1) minimize negative surprises to customers caused by sensitive content, (2) detect and prevent potential brand-damaging interactions, and (3) build customer trust through appropriate interactions on sensitive topics.\n\nThe term sensitive content includes within its scope a wide range of categories of content such as offensive content (e.g., hate speech, racist speech), profanity, content that is suitable only for certain age groups, politically polarizing content, and religiously polarizing content. The term content refers to any material that is exposed to customers by Alexa (including both 1P and 3P experiences) and includes text, speech, audio, and video.\n\nBasic Qualifications\n• 3 years of data scientist experience\n• 3 years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical\/mathematical software (e.g. R, SAS, Matlab, etc.) experience\n• 3 years of machine learning\/statistical modeling data analysis tools and techniques, and parameters that affect their performance experience\n• Experience applying theoretical models in an applied environment\n• Experience with big data: processing, filtering, and presenting large quantities (100K to millions of rows) of data\n\nPreferred Qualifications\n• Experience in Python, Perl, or another scripting language\n• Experience diving into data to discover hidden patterns and conducting error\/deviation analysis\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit Amazon Accommodations for more information. If the country\/region youre applying in isnt listed, please contact your Recruiting Partner.\n\nLocations - Bengaluru, Karnataka, IND",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-PFofDqx1Wg27ZH7wAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.linkedin.com\/jobs\/view\/cyber-and-data-analytics-audit-assistant-vice-president-at-state-street-4168099556?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Cyber and Data Analytics Audit, Assistant Vice President",
        "company":"State Street",
        "location":"Bengaluru, Karnataka",
        "date_posted":1740441600000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Who We Are Looking For\n\nWe are looking for a highly skilled and experienced Cyber and Data Analytics Auditor, Assistance Vice President to join our global Cyber Audit team. To succeed in this role, you need to have a deep understanding of cyber risks processes, controls, industry standards, and should have a strong knowledge of NIST, MITRE, and Defense in Depth concepts. You will also be responsible for developing and implementing analytics-based services and solutions and to drive efficiencies and systemically broaden the bank’s cyber assurance coverage. You will be responsible for working closely with peers from infrastructure, security, and application audit teams while working within a diverse global team. Collaboration with the bank’s cyber security organization is essential. In this role you will join a growing team that is focused on building leading practices, and you will have a functional reporting line to the Vice President of Cyber Audit. The role will be located in Toronto (Canada), Boston (USA), London (UK), or Bangalore (India)\n\nWhy this role is important to us\n\nThe team you will be joining plays an important role in the overall success of the organization. Across the globe, institutional investors rely on us to help them manage risk, respond to challenges, and drive performance and profitability. To make that happen we need teams like yours to help navigate employees and the organization as a whole. In your role you will strive for cutting-edge solutions, that are straightforward and scalable. You will help us build resilience and execute day to day deliverables at our best. Join us if making your mark in the financial services industry from day one is a challenge you are up for.\n\nWhat You Will Be Responsible For\n\nAs Cyber and Data Analytics Audit, Assistance Vice President, you will\n• Work as part of an international team, collaborating closely with global peers for infrastructure, security, application, and business audit.\n• Design, coordinate, and implement data analytic cyber solutions to support audit and innovation initiatives within the planning, assessment, and reporting phases of cyber audits and cyber focused validation activities.\n• Advise Corporate Audit stakeholders on cyber-related data analytic options to address their specific needs, including discussing potential analytical approaches to problems, associated costs and trade-offs, and recommendations.\n• Contribute to the timely execution of innovative analytics-based and process automation solution development within cyber audits and cyber focused validation activities to advance insight-driven assurance and visualization of results and quantitative analytics.\n• Maintain a thorough knowledge of cyber risks, changes in the regulatory environment pertaining to cyber, and innovative assurance approaches.\n• Develop and maintain relationships with key stakeholders across the organization, including the bank’s cyber security organization.\n• Communicate audit progress and findings effectively to senior management.\n• Prepare and review audit work papers to ensure compliance with the division’s audit methodology.\n\nWhat We Value\n\nThese skills will help you succeed in this role\n• Experience leading and supervising audit projects, preferably within the global financial services industry.\n• Proficiency in evaluating cyber risks and testing internal controls while applying risk based testing approaches.\n• Ability to prioritize multiple tasks, working independently and developing relationships with global stakeholders in a fast paced environment.\n• Excellent analytical, problem solving, communication (written and verbal), interpersonal, organizational, and presentation skills.\n• Strong communication, interpersonal, and leadership ability across all levels coupled with effective problem solving, conceptual thinking, quantitative and analytical skills.\n• Strong written and verbal communication, presentation, and technical writing skills.\n• Advanced project management skills.\n• Fluency in English - written and spoken.\n\nEducation & Preferred Qualifications\n• Bachelor's degree in Information Technology, Computer Science or a related field, and statistics, data science, MIS, engineerings, math, accounting, or finance..\n• 5+ years of experience auditing information security, cyber risk management, and experience with data analytics tools such as PC SAS, Enterprise Guide, SQL, Business Objects, Qlikview, Tableau, or Spotfire.\n• Audit or assurance experience working in the banking or financial services industry or other regulated industries.\n• Expertise in evaluating cyber security risks and the ability to develop and implement effective audit testing strategies with a strong understanding of regulatory compliance requirements for the banking industry.\n• Strong knowledge of Cyber and Cloud technologies and tools (Azure, AWS, Snowflake, Databricks, Alteryx), Identity and Access Management, Security Incident and Event Management (SIEM) technologies and cyber operations, and incident and response processes.\n• Exposure to Big Data Initiatives such as Hadoop, Hive, Cloudera, or large data warehousing initiatives.\n• Experience with programming and analytic languages such as SAS, R or Python; working experience with large and diverse RDBMS OLTP or OLAP data stores (Oracle, SQL Server, Teradata).\n• Relevant certifications, such as CISSP, CISA, CISM, CCSP, SAS Certification, ACDA, CAP, CCP, CIA, CFE, CFA, or FRM are highly preferred.\n\nAdditional Requirements\n• Willingness to travel as required.\n\nAre you the right candidate? Yes!\n\nWe truly believe in the power that comes from the diverse backgrounds and experiences our employees bring with them. Although each vacancy details what we are looking for, we don’t necessarily need you to fulfil all of them when applying. If you like change and innovation, seek to see the bigger picture, make data driven decisions and are a good team player, you could be a great fit.\n\nAbout State Street\n\nWhat we do. State Street is one of the largest custodian banks, asset managers and asset intelligence companies in the world. From technology to product innovation, we’re making our mark on the financial services industry. For more than two centuries, we’ve been helping our clients safeguard and steward the investments of millions of people. We provide investment servicing, data & analytics, investment research & trading and investment management to institutional clients.\n\nWork, Live and Grow. We make all efforts to create a great work environment. Our benefits packages are competitive and comprehensive. Details vary by location, but you may expect generous medical care, insurance and savings plans, among other perks. You’ll have access to flexible Work Programs to help you match your needs. And our wealth of development programs and educational support will help you reach your full potential.\n\nInclusion, Diversity and Social Responsibility. We truly believe our employees’ diverse backgrounds, experiences and perspectives are a powerful contributor to creating an inclusive environment where everyone can thrive and reach their maximum potential while adding value to both our organization and our clients. We warmly welcome candidates of diverse origin, background, ability, age, sexual orientation, gender identity and personality. Another fundamental value at State Street is active engagement with our communities around the world, both as a partner and a leader. You will have tools to help balance your professional and personal life, paid volunteer days, matching gift programs and access to employee networks that help you stay connected to what matters to you.\n\nState Street is an equal opportunity and affirmative action employer.\n\nDiscover more at StateStreet.com\/careers\n\nState Street's Speak Up Line\n\nJob ID: R-749936",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-oCzceiOrp50bl567AAAAAA==",
        "site":"google",
        "job_url":"https:\/\/builtin.com\/job\/head-data-ml-platform-engineering-site-lead-hybrid\/4252215?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Head of Data + ML Platform & Engineering Site Lead (Hybrid)",
        "company":"CrowdStrike",
        "location":"Bengaluru, Karnataka",
        "date_posted":1740009600000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":true,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":"recruiting@crowdstrike.com",
        "description":"As a global leader in cybersecurity, CrowdStrike protects the people, processes and technologies that drive modern organizations. Since 2011, our mission hasn’t changed — we’re here to stop breaches, and we’ve redefined modern security with the world’s most advanced AI-native platform. We work on large scale distributed systems, processing almost 3 trillion events per day. We have 3.44 PB of RAM deployed across our fleet of C* servers - and this traffic is growing daily. Our customers span all industries, and they count on CrowdStrike to keep their businesses running, their communities safe and their lives moving forward. We’re also a mission-driven company. We cultivate a culture that gives every CrowdStriker both the flexibility and autonomy to own their careers. We’re always looking to add talented CrowdStrikers to the team who have limitless passion, a relentless focus on innovation and a fanatical commitment to our customers, our community and each other. Ready to join a mission that matters? The future of cybersecurity starts with you.\n\nAbout the Role:\n\nThe charter of the Data + ML Platform team is to harness all the data that is ingested and cataloged within the Data LakeHouse for exploration, insights, model development, ML model development lifecycle, ML engineering, and Insights Activation. This team is situated within the larger Data Platform group, which serves as one of the core pillars of our company. We processdata at a truly immense scale. The data sets we process are composed of various facets\nincluding telemetry data, associated metadata, IT asset information, contextual formation about threat exposure, and many more. These facets comprise the overall data platform, which is currently over 200 PB and maintained in a hyper scale Data Lakehouse.\nWe are seeking a strategic and technically savvy leader to head our Data and ML Platform team. As the head, you will be responsible for defining and building our ML Experimentation Platform from the ground up, while scaling our data and ML infrastructure to support various roles including Data Platform Engineers, Data Scientists, and Threat Analysts. Your key responsibilities will involve overseeing the design, implementation, and maintenance of scalable ML pipelines for data preparation, cataloging, feature engineering, model training, model serving, and in-field model performance monitoring. These efforts will directly influence critical\n\nbusiness decisions. In this role, you'll foster a production-focused culture that effectively bridgesthe gap between model development and operational success. Furthermore, you'll be at the forefront of spearheading our ongoing Generative AI investments. The ideal candidate for this position will combine strategic vision with hands-on technical expertise in machine learning and data infrastructure, driving innovation and excellence across our data and ML initiatives. We are building this team with ownership at Bengaluru, India, this leader will help us boot strap the entire site, starting with this team.\n\nWhat You'll Do:\nStrategic Leadership\n• Define the vision, strategy and roadmap for the organization’s data and ML platform to align with critical business goals.\n• Help design, build, and facilitate adoption of a modern Data+ML platform\n• Stay updated on emerging technologies and trends in data platform, ML Ops and AI\/ML\n\nTeam Management\n• Build a team of Data and ML Platform engineers from a small footprint across multiple geographies\n• Foster a culture of innovation and strong customer commitment for both internal and external stakeholders\n\nPlatform Development\n• Oversee the design and implementation of a platform containing data pipelines, feature stores and model deployment frameworks.\n• Develop and enhance ML Ops practices to streamline model lifecycle Management from development to production.\n\nData Governance\n• Institute best practices for data security, compliance and quality to ensure safe and secure use of AI\/ML models.\n\nStakeholder engagement\n• Partner with product, engineering and data science teams to understand requirements and translate them into platform capabilities.\n• Communicate progress and impact to executive leadership and key stakeholders.\n\nOperational Excellence\n• Establish SLI\/SLO metrics for Observability of the Data and ML Platform along with alerting to ensure a high level of reliability and performance.\n• Drive continuous improvement through data-driven insights and operational metrics.\n\nWhat You'll Need:\n• B.S. in Computer Science, Data Science, Statistics, Applied Mathematics, or a related field and 10+ years related experience; or M.S. with 8+ years of experience; or Ph.D with 6+ years of experience.\n• 10+ years experience in data engineering, ML platform development, or related fields with at least 5 years in a leadership role.\n• Familiarity with typical machine learning algorithms from an engineering perspective; familiarity with supervised \/ unsupervised approaches: how, why and when labeled data is created and used.\n• Knowledge of ML Platform tools like Jupyter Notebooks, NVidia Workbench, MLFlow, Ray, Vertex AI, etc.\n• Experience with modern ML Ops platforms such as MLFLow, Kubeflow or SageMaker preferred.Experience in data platform product(s) and frameworks like Apache Spark, Flink or comparable tools in GCP and orchestration technologies (e.g. Kubernetes, Airflow). Experience with Apache Iceberg is a plus.\n• Deep understanding of machine learning workflows, including model training, deployment and monitoring.\n• Familiarity with data visualization tools and techniques.\n• Experience with boot strapping new teams and growing them to make a large impact.\n• Experience operating as a site lead within a company will be a bonus.\n• Exceptional interpersonal and communication skills. Work with stakeholders across multiple teams and synthesize their needs into software interfaces and processes.\n\n#LI-DP1\n\n#LI-SR1\n\nBenefits of Working at CrowdStrike:\n• Remote-friendly and flexible work culture\n• Market leader in compensation and equity awards\n• Comprehensive physical and mental wellness programs\n• Competitive vacation and holidays for recharge\n• Paid parental and adoption leaves\n• Professional development opportunities for all employees regardless of level or role\n• Employee Resource Groups, geographic neighbourhood groups and volunteer opportunities to build connections\n• Vibrant office culture with world class amenities\n• Great Place to Work Certified™ across the globe\n\nCrowdStrike is proud to be an equal opportunity employer. We are committed to fostering a culture of belonging where everyone is valued for who they are and empowered to succeed. We support veterans and individuals with disabilities through our affirmative action program.\n\nCrowdStrike is committed to providing equal employment opportunity for all employees and applicants for employment. The Company does not discriminate in employment opportunities or practices on the basis of race, color, creed, ethnicity, religion, sex (including pregnancy or pregnancy-related medical conditions), sexual orientation, gender identity, marital or family status, veteran status, age, national origin, ancestry, physical disability (including HIV and AIDS), mental disability, medical condition, genetic information, membership or activity in a local human rights commission, status with regard to public assistance, or any other characteristic protected by law. We base all employment decisions--including recruitment, selection, training, compensation, benefits, discipline, promotions, transfers, lay-offs, return from lay-off, terminations and social\/recreational programs--on valid job requirements.\n\nIf you need assistance accessing or reviewing the information on this website or need help submitting an application for employment or requesting an accommodation, please contact us at recruiting@crowdstrike.com for further assistance.",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-2ZWaOAQjuqreqY7PAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/www.shine.com\/jobs\/security-data-scientist\/arctic-wolf\/16606567?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Security Data Scientist",
        "company":"Arctic Wolf",
        "location":"Karnataka",
        "date_posted":1739404800000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Arctic Wolf, with its unicorn valuation, is the leader in security operations in an exciting and fast-growing industrycybersecurity. We have won countless awards for our excellence in security operations and remain dedicated to providing an industry-leading customer and employee experience.\n\nOur mission is simple: End Cyber Risk. Were looking for a Security Data Scientist to be a part of making this happen.\n\nAbout The Role\n\nData is a critical part of Arctic Wolf Networks mission to solve cyber risk, where we process and analyze hundreds of billions of events every day to look for malicious and risky behaviour. Furthermore, were geeks at heart and are passionate about data and solving cybersecurity problems for our customers. The AI & Data Science team works on analyzing Arctic Wolfs product platforms, internal business challenges, and customer pain points to develop new products and features for our customers.\n\nAs a Security Data Scientist on the AI & Data Science team you will be responsible for developing data-driven solutions leveraging cutting-edge advanced analytics techniques. This involves working closely with engineering, product, operations, and other teams to understand the most important technical and business analytics needs to drive security-centric analytics outcomes. A successful candidate is self-motivated with a passion for excellence and attention to detail.\n\nAs a Security Data Scientist at Arctic Wolf, you will\nAnalyze and correlate complex data from multiple sources.\nPerform exploratory data analysis to gain deeper understanding of the data.\nWork with stakeholders, including domain experts and product, to understand use cases and domain-specific problems and identify opportunities for applying machine learning to drive outcomes.\nDevelop tools and algorithms for generating synthetic data sets.\nDefine KPIs to measure model performance.\nDevelop and test statistical and machine learning models for efficacy and operational impact.\nWrite production quality code and work with other software engineering teams to deploy models into production.\nSupport deployed models as a subject matter expert.\nBe creative and engineer novel features and methods to push beyond our current capabilities.\n\nWe Are Looking For Someone Who Has\nProven track record of a minimum 2+ years of hands-on experiencein the research, data science and engineering around building and shipping machine learning or statistical models that scale to high volumes of data (billions of data points).\nProficiency with Python and SQL.\nExperience using key ML libraries including scikit-learn, tensorflow, pytorch, sparkml.\nExperience with data fusion and data cleansing techniques for creating labelled data sets.\nExperience with developing synthetic data sets using generative and statistical modelling techniques.\nUnderstanding of classical ML and DNN modelling techniques for supervised and unsupervised learning and sequence modelling.\nUnderstanding of 3 of either PGMs, RL, GNN, statistical modelling, or time series modelling.\nUnderstanding of ensembles and multi modal machine learning techniques to solve complex problems.\nFamiliarity of large-scale distributed systems and related technologies such as Spark, Elasticsearch, Kubernetes, etc. is a plus.\nFamiliarity with cloud platforms (we use AWS here) and automation technologies (e.g., Kubernetes, Jenkins, Chef, etc.) is a plus.\nFamiliarity with the information\/cyber security domain is a plus.\n\nAbout Arctic Wolf\n\nAt Arctic Wolf were cultivating a collaborative and productive work environment that welcomes a diversity of backgrounds, cultures, and ideas to make our teams even stronger as we grow globally. Weve been named one of the 50 Most Innovative Companies in the world for 2022 (Fast Company)and the 2nd Most Innovative Security Company. We have won countless awards for our excellence in security operations and remain dedicated to providing an industry-leading customer and employee experience including:\nTop Workday USA (2021-2024)\nGreat Place to Work (2022-2024) & Best Workplaces for Women (2024) in Canada\nBest Workplaces in Tech & For Women in the UK (2023)\nTop Company by Kununu in Germany (2024)\n\nOur Values\n\nArctic Wolf recognizes that success comes from delighting our customers, so we work together to ensure that happens every day. We believe in diversity and inclusion, and truly value the unique qualities and unique perspectives all employees bring to the organization. And we appreciate thatby protecting peoples and organizations sensitive data and seeking to end cyber risk we get to work in an industry that is fundamental to the greater good.\n\nWe celebrate unique perspectives by creating a platform for all voices to be heard through our Pack Unity program. We encourage all employees to join or create a new alliance. See more about our Pack Unity here.\n\nSecurity Requirements\nConducts duties and responsibilities in accordance with AWNs Information Security policies, standards, processes, and controls to protect the confidentiality, integrity and availability of AWN business information (in accordance with our employee handbook and corporate policies).\nBackground checks are required for this position.,",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-36HbPc-byxa3XtNXAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.indeed.com\/viewjob?jk=0ae210a2258aee02&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"I&F-Cyber Security-Investigations & Forensics-Data Analytics -Senior Associate – Bangalore",
        "company":"PwC",
        "location":"Karnataka",
        "date_posted":1738627200000,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Line of Service\nAdvisory\n\nIndustry\/Sector\nNot Applicable\n\nSpecialism\nFraud, Investigations & Regulatory Enforcement (FIRE)\n\nManagement Level\nSenior Associate\n\nJob Description & Summary\nA career in our Cybersecurity, Privacy and Forensics will provide you the opportunity to solve our clients most critical business and data protection related challenges. You will be part of a growing team driving strategic programs, data analytics, innovation, deals, cyber resilency, response, and technical implementation activities. You will have access to not only the top Cybersecurity, Privacy and Forensics professionals at PwC, but at our clients and industry analysts across the globe.\n\nOur Investigations team focuses on helping our clients to detect and investigate fraudulent activities or irregularities within their organisation. As part of our team, you will perform fraud investigations, forensic accounting engagements, litigation support, crisis response, insurance claims support, and address anti-kickback and anti-bribery matters for a diverse group of both public and private multinational clients, not-for profits and state and local governments. You will work closely with the office of general counsel, chief compliance officers, boards and outside counsel. Our team not only helps clients respond to instances of fraud or irregularity, but also works with them to emerge stronger as an entity.\n\nTo really stand out and make us fit for the future in a constantly changing world, each and every one of us at PwC needs to be an authentic and inclusive leader, at all grades\/levels and in all lines of service. To help us achieve this we have the PwC Professional; our global leadership development framework. It gives us a single set of expectations across our lines, geographies and career paths, and provides transparency on the skills we need as individuals to be successful and progress in our careers, now and in the future.\n\nAs a Senior Associate, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. PwC Professional skills and responsibilities for this management level include but are not limited to:\n• Use feedback and reflection to develop self awareness, personal strengths and address development areas.\n• Delegate to others to provide stretch opportunities and coach to help deliver results.\n• Develop new ideas and propose innovative solutions to problems.\n• Use a broad range of tools and techniques to extract insights from from current trends in business area.\n• Review your work and that of others for quality, accuracy and relevance.\n• Share relevant thought leadership.\n• Use straightforward communication, in a structured way, when influencing others.\n• Able to read situations and modify behavior to build quality, diverse relationships.\n• Uphold the firm's code of ethics and business conduct.\n\nOverview:\nPwC’s Insights & Forensics (I&F) Data Analytics team in the Acceleration Center (AC) is seeking a highly skilled and motivated Senior Associate to join our dynamic team. The ideal candidate will bring technical expertise, innovative thinking, and strong analytical skills to deliver insights and value to our clients. This role demands a hands-on professional who can seamlessly work with cross-functional teams, process large volumes of data, and create impactful visualizations and analytics solutions.\n\nKey Responsibilities:\n• Data Analysis & Visualization:\n• Develop and design interactive dashboards, reports, and data visualizations using Power BI and Tableau to provide actionable insights.\n• Collaborate with stakeholders to gather business requirements and transform them into meaningful visuals and stories.\n• Data Engineering & Analytics Development:\n• Utilize Python and PySpark to process, transform, and analyze large datasets efficiently.\n• Implement advanced SQL queries and Alteryx for complex data manipulation, reporting, and validation.\n• Cloud Analytics Solutions:\n• Build, maintain, and optimize analytics workflows using Azure Synapse Analytics and Databricks .\n• Leverage cloud-based solutions to design scalable data pipelines and integrate disparate data sources.\n• Collaboration & Delivery:\n• Partner with US stakeholders and internal teams to understand key business problems and deliver analytics-driven solutions.\n• Document technical workflows, processes, and best practices to ensure high-quality deliverables and knowledge sharing.\n\nRequired Skills & Qualifications:\n• Technical Proficiency:\n• Expert-level knowledge and hands-on experience with Power BI for data visualization and reporting.\n• Proficient in programming with Python and working with distributed computing frameworks like PySpark .\n• Strong command of Advanced SQL and Alteryx for data analysis and manipulation across relational databases.\n• Demonstrated expertise in working with Azure Synapse Analytics and Databricks for building cloud-based data solutions.\n• Problem-Solving & Analytical Thinking:\n• Strong ability to analyze complex business problems and translate them into data-driven solutions.\n• Creative mindset with a focus on delivering value through innovative approaches to analytics and visualization.\n• Communication & Collaboration:\n• Excellent verbal and written communication skills for engaging with stakeholders and explaining technical concepts.\n• Ability to work independently and collaboratively within a team, ensuring high standards of delivery.\n• Education & Experience:\n• Bachelor’s or Master’s degree in Data Science, Data Analytics, Information Systems, or a related field.\n• 5-7 years of relevant experience in data analytics, data engineering, or business intelligence roles.\n• Experience in professional services or consulting is a plus.\n\nGood to Have Skills:\n• Experience in Prompt Engineering and working with Generative AI (GenAI) solutions.\n• Knowledge of Data Science concepts and methodologies.\n• Familiarity with Machine Learning techniques and frameworks.\n• Education & Experience:\n• Bachelor’s or Master’s degree in Data Science, Data Analytics, Information Systems, or a related field.\n• 5-7 years of relevant experience in data analytics, data engineering, or business intelligence roles.\n• Experience in professional services or consulting is a plus.\n\nEducation (if blank, degree and\/or field of study not specified)\nDegrees\/Field of Study required:\n\nDegrees\/Field of Study preferred:\n\nCertifications (if blank, certifications not specified)\n\nRequired Skills\n\nOptional Skills\nAccepting Feedback, Accepting Feedback, Active Listening, Analytical Thinking, Communication, Compliance Oversight, Compliance Risk Assessment, Corporate Governance, Creativity, Cybersecurity, Data Analytics, Debt Restructuring, Embracing Change, Emotional Regulation, Empathy, Evidence Gathering, Financial Crime Compliance, Financial Crime Investigation, Financial Crime Prevention, Financial Record Keeping, Financial Transactions, Forensic Accounting, Forensic Investigation, Fraud Detection, Fraud Investigation {+ 12 more}\n\nDesired Languages (If blank, desired languages not specified)\n\nTravel Requirements\nNot Specified\n\nAvailable for Work Visa Sponsorship?\nNo\n\nGovernment Clearance Required?\nNo",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-AWk_RNH2T0hHGR0eAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/in.indeed.com\/viewjob?jk=e2681ad498a13fa2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"CyberSecurity Data Scientist, Account and Device Intelligence",
        "company":"Google",
        "location":"Karnataka",
        "date_posted":null,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Minimum qualifications:\n• Bachelor's degree or equivalent practical experience.\n• 2 years of experience in data analysis, including identifying trends, generating summary statistics, and drawing insights from quantitative and qualitative data.\n• 2 years of experience managing projects and defining project scope, goals, and deliverables.\n\nPreferred qualifications:\n• Master's degree or PhD in Computer Science, Engineering, Mathematics, Physics or a related technical field.\n• Experience in large-scale data analysis and related tools and processes.\n• Experience in automating processes or applied AI.\n• Knowledge in account security, network engineering, malware or artificial intelligence.\n\nAbout the job\n\nIn this role, you will be working with a team of analysts that assess and address threats against Google accounts. You will identify and solve complex issues at scale and have investigative and technical skills. You will be proactive, motivated, organized, responsible, innovative and are able to work well in a fluid, global, cross-functional, and team-oriented environment and demonstrate technical know-how, effective communication to get things done. You will also work very closely with engineering teams and product teams to make sure that new products and features provide a good, safe experience for users. You will build, leverage and evaluate ML\/AI models to solve cybersecurity and abuse issues.\nAt Google we work hard to earn our users’ trust every day. Trust Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.\n\nResponsibilities\n• Provide high-quality, detailed and actionable qualitative and quantitative understanding of the threat landscape, designing and improving additional data collection, processes and quality measures.\n• Design and build early warning alerts for novel and changing account threats, based on researching, understanding and experimenting with attacker operations and attacker interactions with our systems.\n• Provide and apply our threat intelligence to be ready to respond to new adversarial campaigns.\n• Lead incident response to incidents efforts for Google, including the special response in case of severe incidents in collaboration with the UP\/Account and Device Intelligence (ADI) team.\n• Work together with our GOC team (located in Hyderabad) to scale the operational work required to protect Google accounts, such as handling low severity escalations and alerts, and maintaining the ground truth quality. Provide the training and work with UP\/ADI.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See alsoGoogle's EEO Policy andEEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing ourAccommodations for Applicants form.",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"go-jHclsWVuUF0yjvSYAAAAAA==",
        "site":"google",
        "job_url":"https:\/\/www.foundit.in\/job\/data-scientist-threat-intelligence-security-domain-python-bangalore-7-to-11-years-cisico-bengaluru-bangalore-33777090?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "job_url_direct":null,
        "title":"Data Scientist - Threat intelligence, Security Domain, Python - Bangalore - 7 to 11 Years",
        "company":"Cisico",
        "location":"Bengaluru, Karnataka",
        "date_posted":null,
        "job_type":null,
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":false,
        "job_level":null,
        "job_function":null,
        "listing_type":null,
        "emails":null,
        "description":"Job Description:\n\nWho You'll Work With\n\nCisco is offering an extraordinary opportunity to work with an innovative team with a low process, high throughput culture. We are looking for a highly energetic Data Scientist who can combine technical acumen of network security engineering with strong analytical skills. The team is playing a crucial part in leading breakthrough security capabilities to the thousands of Ciscos current and future customers worldwide. Today, we handle more than 80 billion daily Internet requests from 65 million+ users around the world. Though we take phenomenal pride in being market leaders in threat security for long time, we are constantly innovating and improving our solutions to address the ever-changing threat landscape and changing data security paradigms so that our customer networks are always secured. We take our customers trust in us very seriously and go all the way to ensure we protect their data all times. Our team works on leading Network Intrusion Detection & Prevention System solutions that are all-star, scalable and easily manageable. Our network security portfolio and cloud delivered services cover a wide spectrum of security solutions spanning - Firepower Threat Defense, Snort, Encrypted Visibility Engine.\n\nWorking at Cisco Network Security means being surrounded by passionate, intelligent and creative people that are determined to disrupt the Internet security industry with creative ideas, world-class research and unrivalled products and services. Its a place where the best ideas are quickly transformed into products, features, campaigns and company-wide practices, so it wont be long before you witness the results of your hard work.\nAbout the Role\n\nData is a critical part of our AI\/ML based Threat detection engine, where we process and analyze hundreds of millions of records every day to look for malicious and risky behavior. Furthermore, we are geeks at heart, passionate about data and solving cybersecurity problems for our customers.\n\nAs a Security Data Scientist on the Threat team, you will be responsible for developing data-driven solutions using innovative sophisticated analytics techniques. This involves working closely with engineering, product, operations, and other teams to understand the most important technical and business analytics needs to drive security-centric analytics outcomes. A successful candidate is self-motivated with a passion for excellence and attention to detail.\nWhat You'll Do\n• Analyze and correlate complex data from various sources.\n• Perform exploratory data analysis to gain deeper understanding of the data.\n• Work with stakeholders, including domain experts and product, to understand use cases and domain-specific problems and find opportunities for applying machine learning to drive outcomes.\n• Develop tools and algorithms for generating synthetic data sets.\n• Define KPI's to measure model performance.\n• Develop and test statistical and machine learning models for efficacy and operational impact.\n• Write production quality code and work with other software engineering teams to deploy models into production.\n• Support deployed models as a domain expert.\n• Be creative and engineer novel features and methods to push beyond our current capabilities.\nWho You Are\n• Structure large, sophisticated data sets to find usable information, solve difficulties, and analyze problems with advanced analytical or statistical methods\n• demonstrated ability in a threat intelligence or related security analyst role with Min 7+Years.\n• Proficient in Cybersecurity fundamentals\n• Prior experience in data analysis in Cybersecurity domain\n• General data analysis tools (PySpark\/Pandas\/NumPy), data visualization and any one of the languages Python (preferably), C\/C++\n#WeAreCisco\n\n#WeAreCisco where every individual brings their unique skills and perspectives together to pursue our purpose of powering an inclusive future for all.\n\nOur passion is connectionwe celebrate our employees diverse set of backgrounds and focus on unlocking potential. Cisconians often experience one company, many careers where learning and development are encouraged and supported at every stage. Our\n\ntechnology, tools, and culture pioneered hybrid work trends, allowing all to not only give their best, but be their best.\n\nWe understand our outstanding opportunity to bring communities together and at the heart of that is our people. One-third of Cisconians collaborate in our 30 employee resource organizations, called Inclusive Communities, to connect, foster belonging, learn to be informed allies, and make a difference. Dedicated paid time off to volunteer80 hours each yearallows us to give back to causes we are passionate about, and nearly 86% do!\n\nOur purpose, driven by our people, is what makes us the worldwide leader in technology that powers the internet. Helping our customers reimagine their applications, secure their enterprise, transform their infrastructure, and meet their sustainability goals is what we do best. We ensure that every step we take is a step towards a more inclusive future for all. Take your next step and be you, with us!",
        "company_industry":null,
        "company_url":null,
        "company_logo":null,
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4170341207",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4170341207",
        "job_url_direct":null,
        "title":"Head of AI and Data Science",
        "company":"Licious",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":1740787200000,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"director",
        "job_function":"Engineering",
        "listing_type":null,
        "emails":null,
        "description":"Licious is seeking a visionary\n **Director of AI and Data Science** \n to lead the development of an\n **AI\\-driven Agent Factory** \n . This strategic role involves designing, deploying, and managing autonomous agents and agentic workflows to drive efficiencies across all functions, including engineering, product, and operations. The ideal candidate will have a deep background in\n **AI, ML, LLMs, and automation** \n , along with leadership experience in scaling intelligent systems in a fast\\-paced, data\\-driven environment.\n \n\n\n\n  \n\n\n\n\n\n**Ideal Experience** \n : 10\\-17 years\n \n\n\n\n**Reporting to** \n : Chief Technology and Product Officer\n \n\n\n\n  \n\n\n\n\n\n**Roles and Responsibilities:** \n\n\n\n\n  \n\n\n\n\n\n**1\\.Strategic Leadership:** \n\n\n\n* Define the vision, strategy, and roadmap for the\n **Agent Factory initiative** \n , aligning it with Licious’s business objectives and operational goals.\n* Lead a high\\-performing team of data scientists, AI engineers, and ML specialists to develop\n **intelligent agents** \n and\n **agentic workflows** \n that drive automation across multiple business functions.\n* Foster a culture of innovation, collaboration, and continuous learning within the team.\n\n\n\n**2\\. AI Agent Architecture \\& Development:** \n\n\n\n* Architect and develop scalable, reusable\n **AI agent frameworks** \n that optimize workflow automation, decision\\-making, and customer experiences.\n* Leverage\n **Large Language Models (LLMs)** \n ,\n **deep learning** \n ,\n **reinforcement learning** \n , and\n **multi\\-agent systems** \n to build cutting\\-edge AI solutions.\n* Drive customer support automation, and personalised recommendations.\n\n\n\n**3\\. Cross\\-Functional Collaboration:** \n\n\n\n* Partner with engineering, product, operations, and business stakeholders to identify high\\-impact automation use cases.\n* Collaborate with senior leadership to integrate\n **intelligent agents** \n and\n **AI\\-driven solutions** \n into strategic initiatives, enhancing operational efficiency and customer satisfaction.\n\n\n\n**4\\. Innovation and R\\&D:** \n\n\n\n* Stay at the forefront of advancements in\n **AI\/ML, LLMs, multi\\-agent systems, and autonomous systems** \n to continuously improve agent capabilities.\n* Promote a culture of experimentation and R\\&D, exploring new technologies and methodologies for\n **agent\\-based solutions** \n and\n **AI\\-driven innovation** \n .\n\n\n\n**5\\. Performance \\& Scalability:** \n\n\n\n* Ensure the scalability, reliability, and performance of deployed AI agents by leveraging best practices in\n **MLOps** \n and\n **cloud\\-native architectures** \n .\n* Define, monitor, and analyze key performance metrics to measure agent efficiency, productivity gains, and business impact.\n\n\n\n**6\\. Governance \\& Compliance:** \n\n\n\n* Establish\n **AI governance frameworks** \n to ensure ethical AI usage, responsible automation, and data privacy compliance.\n* Drive best practices in security, monitoring, and\n **CI\/CD pipelines** \n for intelligent systems.\n\n\n\n  \n\n\n\n\n\n**Must Have Skills and Experience:** \n\n\n\n* 10\\+ years of experience in\n **software engineering, data science, or AI\/ML** \n , with at least 5 years in a leadership role (preferably at Director level or above).\n* Proven track record of building and scaling\n **AI\\-driven automation systems** \n in complex, data\\-driven environments.\n* Strong expertise in\n **AI, machine learning, deep learning, LLMs, and multi\\-agent systems** \n .\n* Proficiency in\n **Python** \n and ML frameworks such as\n **TensorFlow, PyTorch, or JAX** \n .\n* Hands\\-on experience with\n **LangChain, OpenAI APIs, Hugging Face, or similar technologies** \n for building intelligent agents and LLM\\-based applications.\n* Hands\\-on experience with cloud platforms (\n **AWS, GCP, or Azure** \n ) and modern\n **MLOps practices** \n , including CI\/CD pipelines for ML models.\n* Familiarity with\n **workflow automation tools** \n ,\n **multi\\-agent orchestration frameworks** \n , and scalable data pipelines.\n* Exceptional leadership skills with a proven ability to build, mentor, and lead high\\-performing engineering and data science teams.\n* Excellent communication and stakeholder management skills, with the ability to influence and drive change at executive levels.\n\n\n\n  \n\n\n\n\n\n**Good to Have Skills and Experience:** \n\n\n\n* Experience working in\n **D2C, e\\-commerce, or supply chain optimisation** \n environments.\n* Knowledge of\n **real\\-time AI applications** \n ,\n **complex decision\\-making systems** \n , and\n **reinforcement learning frameworks** \n .\n* Demonstrated ability to drive innovation, R\\&D initiatives, and strategic AI\/ML projects that have transformed business operations.\n* Experience in setting\n **AI\/ML strategy** \n and aligning it with organisational goals and business value\n\n\n\n  \n\n\n\n\n\n**Educational Qualifications:** \n\n\n\n\n B.Tech\/M.Tech\/M.S.\/Ph.D. in a relevant stream of Computer Science from an premier educational institution",
        "company_industry":"Food and Beverage Services, Software Development, and Internet Marketplace Platforms",
        "company_url":"https:\/\/in.linkedin.com\/company\/licious",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/C4D0BAQHvYQ7PDaIOsQ\/company-logo_100_100\/company-logo_100_100\/0\/1654143406363\/licious_logo?e=2147483647&v=beta&t=7fHdSbymDzxRop0M1NKcArGvtW_JlNx6Tc1Wd5gK4Eg",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4145081177",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4145081177",
        "job_url_direct":"https:\/\/careers.microsoft.com\/us\/en\/job\/1806305\/Data-Scientist?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed&urlHash=vlfa",
        "title":"Data Scientist",
        "company":"Microsoft",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":1740700800000,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"not applicable",
        "job_function":"Engineering and Information Technology",
        "listing_type":null,
        "emails":null,
        "description":"**Overview**\n The\n **Business \\& Industry Copilots group** \n is a rapidly growing organization that is responsible for the Microsoft Dynamics 365 suite of products, Power Apps, Power Automate, Dataverse, AI Builder, Microsoft Industry Solution and more. Microsoft is considered one of the leaders in Software as a Service in the world of business applications and this organization is at the heart of how business applications are designed and delivered.\n   \n\n  \n\n This is an exciting time to join our group\n **Customer Zero Engineering** \n and work on something highly strategic to Microsoft. The goal of Customer Zero Engineering is to build the next generation of our applications running on Dynamics 365, AI, Copilot, and several other Microsoft cloud services to deliver high value, complete, and Copilot\\-enabled application scenarios across all devices and form factors. We innovate quickly and collaborate closely with our partners and customers in an agile, high\\-energy environment. Leveraging the scalability and value from Azure \\& Power Platform, we ensure our solutions are robust and efficient. If the opportunity to collaborate with a diverse engineering team, on enabling end\\-to\\-end business scenarios using cutting\\-edge technologies and to solve challenging problems for large scale 24x7 business SaaS applications excite you, please come and talk to us!\n   \n\n  \n\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n   \n\n  \n\n**Job Description**\n We are looking for a highly motivated and skilled Machine Learning Scientist II \/ MLOps Engineer II to join our team. The ideal candidate will have a strong background in machine learning, MLOps\/AIOPs, and software engineering practices, and will be responsible for the development, deployment, and operationalization of machine learning models at scale. This role will work closely with data scientists, software engineers, and product teams to ensure the models are secure, reliable, and performant.\n   \n\n  \n\n**Responsibilities**\n**Key Responsibilities:**\n* Model Development \\& Deployment:\n+ Collaborate with data scientists and engineers to design, build, and deploy machine learning models at scale.\n+ Develop and maintain MLOps\/AIOPs pipelines to automate the end\\-to\\-end lifecycle of machine learning models (from development to deployment, monitoring, and retraining).\n+ Work on the integration of models into production systems while ensuring scalability, security, and performance.\n\n* Model Operationalization:\n+ Implement CI\/CD pipelines for ML models, ensuring smooth deployments with minimal downtime.\n+ Design and deploy robust monitoring and alerting systems for ML models in production to detect issues such as model drift or data skew.\n+ Implement model governance, version control, and logging systems to ensure compliance with internal standards and external regulations.\n\n* Optimization \\& Scalability:\n+ Optimize machine learning models and pipelines for performance and cost efficiency (compute, storage).\n+ Manage infrastructure for ML workloads using cloud\\-native tools (Azure, Kubernetes, Docker) or other container orchestration platforms.\n\n* Collaboration \\& Communication:\n+ Partner with cross\\-functional teams, including Data Engineering, Product Management, and other Engineering teams to build cohesive solutions.\n+ Provide technical guidance to junior engineers and drive best practices for MLOps\/AIOPS within the team.\n\n* Security \\& Compliance:\n+ Work on securing models, data pipelines, and infrastructure in compliance with Microsoft's security standards.\n+ Ensure that the entire ML lifecycle adheres to privacy and compliance requirements (e.g., GDPR, CCPA).\n\n\n**Qualifications**\n**Required Skills:**\n* 4\\+ years of experience in machine learning, MLOps\/AIOPs, or software engineering roles.\n* Proven track record of deploying large\\-scale machine learning systems in production.\n* Strong experience with cloud platforms (Azure preferred) and infrastructure as code (e.g., Terraform, ARM templates).\n* Advanced knowledge of MLOps\/AIOPs practices, including pipeline automation, monitoring, and orchestration.\n* Experience optimizing ML models for performance and scalability in production environments.\n* Demonstrated ability to lead initiatives, mentor junior team members, and influence cross\\-functional teams.\n* Solid understanding of security and compliance frameworks relevant to ML operations.\n* Hands\\-on experience in building and deploying ML models in a cloud environment (preferably Azure).\n* Proficiency in Python and experience with ML frameworks (e.g., TensorFlow, PyTorch).\n* Experience with containerization (Docker, Kubernetes) and microservices architecture.\n* Strong knowledge of CI\/CD tools and workflows (Azure DevOps, GitHub Actions).\n* Basic understanding of model monitoring, retraining, and model governance practices.\n\n\n**Desired Skills**\n* Experience with Azure Machine Learning, Azure Fabric, Synapse, or similar platforms.\n* Strong understanding of data versioning, governance, and reproducibility in ML workflows.\n* Knowledge of responsible AI practices, including fairness, transparency, and bias mitigation.\n* Strong communication skills and the ability to work in a fast\\-paced, collaborative environment.\n\n\n \\#BICJobs\n   \n\n  \n\n Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and\/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
        "company_industry":"Software Development",
        "company_url":"https:\/\/www.linkedin.com\/company\/microsoft",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/C560BAQE88xCsONDULQ\/company-logo_100_100\/company-logo_100_100\/0\/1630652622688\/microsoft_logo?e=2147483647&v=beta&t=lMkCSsceJNmUG1r0VRg3Whye1sVi2KtYvt-MWyfoNbY",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4105513160",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4105513160",
        "job_url_direct":null,
        "title":"Data Scientist",
        "company":"Tesco Bengaluru",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":1740700800000,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"not applicable",
        "job_function":"Information Technology",
        "listing_type":null,
        "emails":"_india@tesco.com",
        "description":"****Company Description****\n Tesco Bengaluru: We are a multi\\-disciplinary team creating a sustainable competitive advantage for Tesco by standardising processes, delivering cost savings, enabling agility, providing cutting\\-edge technological solutions and empowering our colleagues to do ever more for our customers. With cross\\-functional expertise in Global Business Services and Retail Technology \\& Engineering, a wide network of teams and strong governance we reduce complexity thereby offering high quality services for our customers. Tesco Bengaluru, established in 2004 to enable standardisation and build centralised capabilities and competencies, makes the experience better for our millions of customers worldwide and simpler for over 4,40,000 colleagues.\n   \n\n  \n\n Tesco Technology consists of people from a number of different backgrounds, but having a common purpose to serve our shoppers a little better every day with our retail technological solutions. We shared a common interest in harnessing innovations in technology to enhance their shopping experience at Tesco stores. Whether making products, software or systems, our teams focuses on various aspects from taking strategic ownership of the architecture to delivering technological solutions such as design, testing, deployment, infrastructure, operation and security of the systems to ensure agile, smooth and safe operations. These help us to deliver the maximum business impact. Teams refine their internal processes to best fit their own needs, working to build core capabilities in application and services. We collaborate globally across teams to build end\\-to\\-end customer\\-facing solutions, as well as to share knowledge, experience, tools and techniques.\n   \n\n  \n\n At Tesco, inclusion means that Everyone?s Welcome. Everyone is treated fairly and with respect; by valuing individuality and uniqueness we create a sense of belonging.\n   \n\n  \n\n Diversity and inclusion have always been at the heart of Tesco. It is embedded in our values: we treat people how they want to be treated. We always want our colleagues to feel they can be themselves at work and we are committed to helping them be at their best.\n   \n\n  \n\n Across the Tesco group we are building an inclusive workplace, a place to actively celebrate the cultures, personalities and preferences of our colleagues ? who in turn help to build the success of our business and reflect the diversity of the communities we serve.\n   \n\n  \n\n****Job Description****\n Data Scientist\n   \n\n  \n\n**Job Description**\n  \n\n  \n\n At Tesco; our Data Science team focuses on modelling complex business problems and  deploying  data products at scale. Our work spans across multiple areas including physical stores; online; supply chain; marketing and Clubcard; where we encourage rotation amongst our Data Scientists so they can gain expertise in different subjects.\n   \n\n  \n\n We work on several domains and problem types: online; pricing; security; fulfilment; distribution; property; IoT and computer vision are just some. Our team members spend 10% of their week on learning and personal development. Multiple academic collaborations enrich the team expertise; knowledge sharing events are regular. Furthermore; we have a great work\\-life balance; team days and relaxed but engaging culture.\n   \n\n  \n\n**Role Description**\n  \n\n  \n\n This is a hands\\-on position where you will need to leverage your analytical mindset to find solutions to complex problems.  As a Data Scientist; you will need to  understand difficult business problems and prototype solutions  with minimal support. Apply; modify and design algorithms and mathematical models to solve business problems  on top of big data architectures (Hadoop; Spark) is a core component of the role. Our data scientists will need to be able to validate; document and present the modeling process and performances; as well as communicate complex solutions in a clear; understandable way to non\\-experts. Data Scientists are also responsible for promoting data science across Tesco  and promote Tesco across the external Data Science community.\n   \n\n  \n\n  \n\n  \n\n  \n\n  \n\n**Candidate Description**\n  \n\n  \n\n We are looking for ambitious individuals with a mix of statistics; programming; and machine learning skills.  The role requires that you have an extensive background in machine learning and data mining. A track record in modifying and designing advanced algorithms and applying them to large data sets is essential.\n   \n\n  \n\n An ideal candidate will have a scientific mentality with the ability to ask the right questions; as well as answer them. A strong numerical higher degree in a mathematical; scientific; engineering or computer science discipline is preferable; as well as a solid understanding of mathematics and statistical principles.\n   \n\n  \n\n Experience in one or more of the following fields is required: predictive modelling; operational research; deep learning; and time series modelling. Finally; strong programming experience (Python is preferred).\n   \n\n  \n\n  \n\n  \n\n****Qualifications****\n Data Science \\- Machine Learning\n   \n\n  \n\n****Additional Information****\n Important Notice:\n   \n\n  \n\n On behalf of Tesco Bengaluru, we must caution all job seekers and educational institutions that Tesco Bengaluru does not authorise any third parties to release employment offers or conduct recruitment drives via a third party. Hence, beware of inauthentic and fraudulent job offers or recruitment drives from any individuals or websites purporting to represent Tesco. Further, Tesco Bengaluru does not charge any fee or other emoluments for any reason (including without limitation, visa fees) or seek compensation from educational institutions to participate in recruitment events.\n   \n\n  \n\n Accordingly, please check the authenticity of any such offers before acting on them and where acted upon, you do so at your own risk. Tesco Bengaluru shall neither be responsible for honouring or making good the promises made by fraudulent third parties, nor for any monetary or any other loss incurred by the aggrieved individual or educational institution.\n   \n\n  \n\n In the event that you come across any fraudulent activities in the name of Tesco Bengaluru, please feel free report the incident at recruitment\\_compliance\\_india@tesco.com",
        "company_industry":"Retail",
        "company_url":"https:\/\/in.linkedin.com\/company\/tesco-bengaluru",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQFNqJip6BEwGw\/company-logo_100_100\/company-logo_100_100\/0\/1688367507340\/tesco_bengaluru_logo?e=2147483647&v=beta&t=RNhSg7-j-lU4JLvK8r-VtORAikcZ6GcI8M0sqJiRom4",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4169336809",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4169336809",
        "job_url_direct":"https:\/\/paypal.eightfold.ai\/careers?domain=paypal.com&sort_by=relevance&query=R0123069&Codes=W-LINKEDIN&urlHash=gxDS",
        "title":"Data Scientist 1",
        "company":"PayPal",
        "location":"Bengaluru, Karnataka, India",
        "date_posted":1740700800000,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"not applicable",
        "job_function":"Engineering and Information Technology",
        "listing_type":null,
        "emails":"paypalglobaltalentacquisition@paypal.com",
        "description":"**The Company**\n PayPal has been revolutionizing commerce globally for more than 25 years. Creating innovative experiences that make moving money, selling, and shopping simple, personalized, and secure, PayPal empowers consumers and businesses in approximately 200 markets to join and thrive in the global economy.\n   \n\n  \n\n We operate a global, two\\-sided network at scale that connects hundreds of millions of merchants and consumers. We help merchants and consumers connect, transact, and complete payments, whether they are online or in person. PayPal is more than a connection to third\\-party payment networks. We provide proprietary payment solutions accepted by merchants that enable the completion of payments on our platform on behalf of our customers.\n   \n\n  \n\n We offer our customers the flexibility to use their accounts to purchase and receive payments for goods and services, as well as the ability to transfer and withdraw funds. We enable consumers to exchange funds more safely with merchants using a variety of funding sources, which may include a bank account, a PayPal or Venmo account balance, PayPal and Venmo branded credit products, a credit card, a debit card, certain cryptocurrencies, or other stored value products such as gift cards, and eligible credit card rewards. Our PayPal, Venmo, and Xoom products also make it safer and simpler for friends and family to transfer funds to each other. We offer merchants an end\\-to\\-end payments solution that provides authorization and settlement capabilities, as well as instant access to funds and payouts. We also help merchants connect with their customers, process exchanges and returns, and manage risk. We enable consumers to engage in cross\\-border shopping and merchants to extend their global reach while reducing the complexity and friction involved in enabling cross\\-border trade.\n   \n\n  \n\n Our beliefs are the foundation for how we conduct business every day. We live each day guided by our core values of Inclusion, Innovation, Collaboration, and Wellness. Together, our values ensure that we work together as one global team with our customers at the center of everything we do – and they push us to ensure we take care of ourselves, each other, and our communities.\n   \n\n  \n\n**Job Description Summary:**\n What you need to know about the role Highly motivated team player with strong analytical acumen and critical thinking. You will be working with stakeholders across product and operations teams for executing portfolio initiatives that have direct impact on PayPal’s bottom\\-line and customer experience. Meet our team Global Resolutions, and Protections (GRIT) is an integral and critical part of PayPal’s core business model and value proposition. It plays an indispensable role in mitigating and managing different kinds of risks associated with a transaction or customer; increasing PayPal margin and striking a fine balance between managing costs while optimizing customer experience. Analytics is core to GRIT at PayPal and we are a highly data driven organization. We leverage data driven insights extensively in these areas.\n   \n\n  \n\n**Job Description:**\n**Your way to impact**\n PayPal is a data \\& AI company and at our core we leverage data driven insights to drive product decisions.\n   \n\n  \n\n You will identify and work on problems that have high impact on key business metrics. You will analyse KPIs and deep dive on trends and propose solutions to fix them with an associated business impact.\n   \n\n  \n\n**Your day to day**\n* You will maintain the and manage PayPal’s Chargebacks resolution programs delivering value to PayPal’s buyers and sellers while optimizing the margin through loss and OpEx reduction.\n* You will play a critical role in developing strategies and identifying opportunities needed to deliver the ideal resolution experience to our customers in the most cost effective, sustainable model.\n* You will work closely with key stakeholders in the Business Units for specific solutions as well as operational and product teams for implementation and execution of RnP programs and initiatives.\n* You will extensively use data driven insights combined with business knowledge to help drive loss savings, optimization, and customer experience improvement ideas.\n* You will have the opportunity and challenge to constantly improve and adapt solutions to the fast\\-changing face of online commerce, analyze information and exercise solid judgement to bring it all together to make a tangible difference to PayPal’s business \\- While the end objectives will be clear, the ways to achieve it will challenge you to constantly innovate and adapt.\n* If your skill sets match the role, you can be assured of a fulfilling career with overwhelming opportunities to learn, grow and succeed in one of the fastest growing industries in the world.\n\n\n**What Do You Need To Bring\\-**\n* Strong desire and ability to work in a dynamic, global, innovative, and fast\\-paced environment.\n* 5 \\+ years of related experience in Analytics in a fast moving and matrixed environment and knowledge of and experience in data and visualization tools such as SAS, SQL, Teradata, Python, QlikView, Tableau\n* Command of Statistics and Optimization concepts with a focus on utilizing data insights to solve business problems with comfort and interest in the manipulation and analysis of large datasets\n* Identify problems and define key business requirements\n* Solid communication and presentation skills with an ability to story\\-tell and translate analysis and insights into actionable recommendations\n* Outstanding problem\\-solving skills, with strong ability to drive towards action and impact\n* Innate curiosity to learn and develop\n* Bachelors, MBA\/ Masters of Finance, Mathematics, Statistics, Computer Science or Economics preferred or equivalent experience in an analytical role\n\n\n For the majority of employees, PayPal's balanced hybrid work model offers 3 days in the office for effective in\\-person collaboration and 2 days at your choice of either the PayPal office or your home workspace, ensuring that you equally have the benefits and conveniences of both locations.\n   \n\n  \n\n**Our Benefits:**\n At PayPal, we’re committed to building an equitable and inclusive global economy. And we can’t do this without our most important asset—you. That’s why we offer benefits to help you thrive in every stage of life. We champion your financial, physical, and mental health by offering valuable benefits and resources to help you care for the whole you.\n   \n\n  \n\n We have great benefits including a flexible work environment, employee shares options, health and life insurance and more. To learn more about our benefits please visit https:\/\/www.paypalbenefits.com\n   \n\n  \n\n**Who We Are:**\n To learn more about our culture and community visit https:\/\/about.pypl.com\/who\\-we\\-are\/default.aspx\n   \n\n  \n\n**Commitment to Diversity and Inclusion**\n PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and\/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state, or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at paypalglobaltalentacquisition@paypal.com.\n   \n\n  \n\n**Belonging at PayPal:**\n Our employees are central to advancing our mission, and we strive to create an environment where everyone can do their best work with a sense of purpose and belonging. Belonging at PayPal means creating a workplace with a sense of acceptance and security where all employees feel included and valued. We are proud to have a diverse workforce reflective of the merchants, consumers, and communities that we serve, and we continue to take tangible actions to cultivate inclusivity and belonging at PayPal.\n   \n\n  \n\n Any general requests for consideration of your skills, please Join our Talent Community.\n   \n\n  \n\n We know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates. Please don’t hesitate to apply.\n   \n\n  \n\n REQ ID R0123069",
        "company_industry":"Software Development, Financial Services, and Technology, Information and Internet",
        "company_url":"https:\/\/www.linkedin.com\/company\/paypal",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/D560BAQGlX0cKdGRk-w\/company-logo_100_100\/company-logo_100_100\/0\/1725506319701?e=2147483647&v=beta&t=EfHoqyaVYveWMzdT_6PpJbGNGS1P4dUk3ZryqIQRhjc",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    },
    {
        "id":"li-4171097909",
        "site":"linkedin",
        "job_url":"https:\/\/www.linkedin.com\/jobs\/view\/4171097909",
        "job_url_direct":"https:\/\/jobs.standardchartered.com\/job\/Bangalore-Analyst%2C-Data-Science%28India%2C-Malaysia%2C-Philippines%29\/813260602\/?feedId=363857&amp;utm_source=CareerSite&urlHash=WwRE",
        "title":"Analyst, Data Science(India, Malaysia, Philippines)",
        "company":"Standard Chartered Life and Careers",
        "location":"Bengaluru East, Karnataka, India",
        "date_posted":1740700800000,
        "job_type":"fulltime",
        "salary_source":null,
        "interval":null,
        "min_amount":null,
        "max_amount":null,
        "currency":null,
        "is_remote":null,
        "job_level":"entry level",
        "job_function":"Information Technology",
        "listing_type":null,
        "emails":null,
        "description":"**Job Summary**\n This role could be based in India Malaysia and Philippines. When you start the application process you will be presented with a drop down menu showing all countries, Please ensure that you select a country\n   \n\n  \n\n where the role is based.\n   \n\n  \n\n As a Responsible AI Data Scientist for Strategy and Talent’s Human\\-Centered AI and Innovation Department at Standard Chartered, you will work at the forefront of empowering responsible AI adoption within Strategy and Talent (S\\&T), and thereby help shape the future of employee\/candidate\\-facing AI solutions that S\\&T enable and influence for the entire organization. This role demands a strong understanding of machine learning techniques, and an avid interest in AI ethics, especially addressing potential biases in data and algorithms, explainability, AI literacy, and strategies to promote transparency and accountability.\n   \n\n  \n\n By applying your technical skills, responsible AI practices, human\\-centric mindsets, and start\\-up intuition to AI and innovation solutions in both early\\-stage experimentations and strategic initiatives, you will help define the strategy and experiences we build for our clients, partners and colleagues globally.\n   \n\n  \n\n You will collaborate on a wide range of product and business problems with a diverse set of cross\\-functional stakeholders such as but not limited to Human Resources, Corporate Affairs and Brand Marketing, Corporate Real Estate Solutions, Supply Chain Management, Chief Data Office – Responsible AI and Data Ethics, Technology, Businesses, Conduct and Compliance, and Legal to ensure responsible adoption of AI solution within S\\&T.\n   \n\n  \n\n* Responsible AI advocacy: You will act as the beacon of change and advocacy on human\\-centered AI, responsible AI, data and AI ethics, cross all cross\\-functional and S\\&T business engagements, to cross\\-pollinate ideas and values.\n* AI\\-innovation measurements: You will guide teams to understand AI methods, data, and insights. You will design and advice logical desirability signals, qualitative, and quantitative metrics to evaluate the return of investment on AI and innovation solutions.\n* Communication and influence: You will translate, convince, and influence S\\&T business and cross\\-functional stakeholders using clear insights, use cases, and recommendations in approachable and simple terms. You will build credibility through structure, clarity, and socialization.\n\n\n**Key Responsibilities**\n* Apply technical data science expertise to support S\\&T AI solutions and products throughout the lifecycle of responsible AI governance and advise responsible AI adoption according to our Group RAI Standards and RAI governance process\n* Bias and fairness assessment and AI explainability: Design test cases, advise methods, and deploy methods, especially on fairness, data suitability, and explainability for AIML solutions to meet internal RAI standards. You will be expected to develop, advice, consult, and\/or implement testing methods to identify and mitigate biases in datasets and AI models, minimizing unjust bias.\n* Create tools and processes to enhance the explainability of AI models, fostering transparency and trust in algorithm decision\\-making. Ensuring explainability in human factors along the AI adoption journey\n* Vendor liaison: Liaise and evaluate AI offerings and technical documentations of third\\-party enterprise AI vendors and internal AI vendors to inform business decision making and RAI governance\n* Review and validate AI use cases based on the applicable standards, assessments, and controls required to adhere to Responsible AI standards, uphold data and AI ethics, and other AI\\-related governance, including ongoing and future AI and data audits\n* Communicate AIML methods and data concepts in simple terms to non\\-technical stakeholders\n* Drive data and AI ethics awareness through data, insights, and\/or use cases discussions with S\\&T stakeholders\n* Embed and advocate for human\\-centricity in AI solutions development and downstream impact on people and processes\n* Define impact metrics, measurements, and other levers of success for AI solutions and products impacting S\\&T business\n* Partner with Responsible AI, Technology, Cybersecurity, and other cross\\-functional teams to inform, influence, support, and execute S\\&T AI solution strategy and investment decisions\n* Proactively research to stay current on emerging trends, AI and data regulations, and best practices in RAI, actively proposing improvement and adaptations to our approach\n* Participate in strategic initiatives and working groups that set the pace for strategic directions on (gen)AI adoption\n\n\n**Regulatory and Business Conduct**\n* Display exemplary conduct and live by the Group’s Values and Code of Conduct.\n* Take personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\n* Effectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\n\n\n**Other Responsibilities**\n* Embed Here for good and Group’s brand and values in team\n* Perform other responsibilities assigned under Group, Country, Business or Functional policies and procedures\n* Multiple functions (double hats)\n\n\n**Skills And Experience**\n* Business Communication Skills\n* Critical thinking\n* Data Science, Statistics\n* ML, DL, NLP\n* SQL, Dataiku\n* Generative AI – LLMs, fine\\-tuning techniques\n* AI ethics\n* Specific skills – to craft out interview process and interview guides for interviewers later on:\n\n\n**Soft Skills**\n* Effective business communication skills including but not limited to vendor management, data translation, and data storytelling skills\n* Excellent change management and business process skills with ability to develop strategy, evaluate efficacy\n* Empathetic, growth mindset, human\\-centric approach, entrepreneurial spirit, resourceful, excellent cross\\-functional, interdisciplinary collaboration skills\n* Creative thinking, critical thinking, and conscientiousness\n\n\n**RAI Skills**\n* Knowledge of AI ethics, AI risk, human\\-centered AI, model and data governance practices and related business and technology issues related to enterprise\\-wide information\n* Awareness of best practices in testing bias, fairness and stability, and ability to understand results from risk management\n* Experience in industry best practices of model risk management and AI fairness and explainability, including model validation, reproducibility, statistical and engineering process control, quality assurance, and data\/model shift\n\n\n**AIML domain expertise**\n* Real world experience with machine\/deep learning, artificial intelligence, statistical analysis and modelling, natural language\/computational linguistics, computer vision, signal processing, and\/or generative AI, preferably in Python\n* MLOps and data engineering\n* Knowledge and experience with dataiku, databricks, MLOps, and both SQL and noSQL database design, queries, and storage\n\n\n**Qualifications**\n* 5\\+ years of work experience in a data science capacity\n* OR minimum of 3\\+ years of work experience in a data science capacity with a Doctorate in a quantitative discipline\\*\n* OR Field transfers from 4\\+ years of work experience in analytics, risks and governance, tech and operations, legal, and\/or Data Privacy with a Masters, MPhil, or Ph.D. in a quantitative discipline\\* or 2\\+ equivalent data science work experience\n* Real world experience with machine\/deep learning, artificial intelligence, statistical analysis and modelling, natural language\/computational linguistics, computer vision, signal processing, and\/or generative AI, preferably in Python\n* Aware of AI ethics, AI risk, human\\-centered AI, model and data governance practices and HR\\-related AI regulations and policies\n* Experience influencing and partnering with cross\\-functional stakeholders and third\\-party vendors\n* Effective business communication skills including but not limited to vendor management, data translation, and data storytelling skills\n* Bachelor’s degree in Computer Science, Data Science, Statistics, Artificial Intelligence\n* Preferred Qualifications\n* Masters, MPhil, or Doctorate degree in quantitative discipline\\* like Computer Science, Data Science, Statistics, Artificial Intelligence, Human\\-computer interaction, Computational Linguistics, Behavioral Sciences\n* Familiarity with legal and regulatory requirements related to AI\n* Hands\\-on experience on AI ethics and data ethics governance\n* Experience working in highly regulated industries like finance and healthcare\n* Practical experience with genAI (LLMs\/RAG), agentic AI, dataiku, databricks, MLOps, and both SQL and noSQL database design, queries, and storage\n* 5\\+ years of work experience in Risk Management and Governace, Privacy, Security, Compliance, Investigations, Operations, Auditing, and\/or Finances\n* Awareness of best practices in testing bias, fairness and stability, and ability to understand results from risk management\n* Experience in industry best practices of model risk management and AI fairness and explainability, including model validation, reproducibility, statistical and engineering process control, quality assurance, and data\/model shift\n\n\n**About Standard Chartered**\n We're an international bank, nimble enough to act, big enough for impact. For more than 170 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents and we can't wait to see the talents you can bring us.\n   \n\n  \n\n Our purpose, to drive commerce and prosperity through our unique diversity, together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion.\n   \n\n  \n\n**Together We**\n* Do the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we do\n* Never settle, continuously striving to improve and innovate, keeping things simple and learning from doing well, and not so well\n* Are better together, we can be ourselves, be inclusive, see more good in others, and work collectively to build for the long term\n\n\n**What We Offer**\n**In line with our Fair Pay Charter,** \n we offer a competitive salary and benefits to support your mental, physical, financial and social wellbeing.\n   \n\n  \n\n* Core bank funding for retirement savings, medical and life insurance, with flexible and voluntary benefits available in some locations.\n* Time\\-off including annual leave, parental\/maternity (20 weeks), sabbatical (12 months maximum) and volunteering leave (3 days), along with minimum global standards for annual and public holiday, which is combined to 30 days minimum.\n* Flexible working options based around home and office locations, with flexible working patterns.\n* Proactive wellbeing support through Unmind, a market\\-leading digital wellbeing platform, development courses for resilience and other human skills, global Employee Assistance Programme, sick leave, mental health first\\-aiders and all sorts of self\\-help toolkits\n* A continuous learning culture to support your growth, with opportunities to reskill and upskill and access to physical, virtual and digital learning.\n* Being part of an inclusive and values driven organisation, one that embraces and celebrates our unique diversity, across our teams, business functions and geographies \\- everyone feels respected and can realise their full potential.",
        "company_industry":"Banking",
        "company_url":"https:\/\/uk.linkedin.com\/showcase\/standard-chartered-life-and-careers\/",
        "company_logo":"https:\/\/media.licdn.com\/dms\/image\/v2\/C4D0BAQEkSZKDDU4sJQ\/company-logo_100_100\/company-logo_100_100\/0\/1630507876566\/early_careers_standard_chartered_bank_logo?e=2147483647&v=beta&t=ToJ0EOClPh8ExQXM-GhhE71IO6EkwzCbtNCg_5fxuUA",
        "company_url_direct":null,
        "company_addresses":null,
        "company_num_employees":null,
        "company_revenue":null,
        "company_description":null
    }
]